{"question":{"0":"In Haley's class 13 boys love to play marbles and 50 boys love to play cards. If Haley has 26 marbles How many will each of the boys receive?","1":"Kelly has 22 nintendo games. How many does she need to buy so that she will have 140 games left?","2":"Matthew had 22 crackers and 34 cakes. If Matthew gave equal numbers of crackers and cakes to his 11 friends How many crackers did each person eat?","3":"Jerry had 2 action figures and 10 books on a shelf in his room. Later he added 4 more action figures to the shelf. How many more books than action figures were on his shelf?","4":"They decided to hold the party in their backyard. If they have 11 sets of tables and each set has 13 chairs How many chairs do they have in the backyard?","5":"Jake has 84 more apples and 10 fewer peaches than Steven. Steven has 13 peaches and 52 apples. How many peaches does Jake have?","6":"Baker made some cakes. He sold 145 of them. If he still has 72 cakes left How many cakes did baker make?","7":"At the arcade Dave had won 14 tickets and lost 2 tickets. If he used 10 to buy some toys How many tickets did Dave have left?","8":"Faye was placing 30 pencils into rows with 5 pencils in each row. How many rows could she make?","9":"Rachel had to complete 4 pages of reading homework, 7 pages of math homework and 19 more pages of biology homework. How many more pages of math homework than reading homework did she have?","10":"Danny collects bottle caps and wrappers. He found 22 bottle caps and 8 wrappers at the park. Now he has 28 bottle caps and 63 wrappers in his collection. How many bottle caps did danny have at first?","11":"Rachel picked 7 apples from her tree. Thereafter 2 new apples grew on the tree. Now the tree has 6 apples still on it. How many apples did the tree have to begin with?","12":"Marco and his dad went strawberry picking. Marco's strawberries weighed 10 pounds. If together their strawberries weighed 26 pounds. How much more did his dad's strawberries weigh than his?","13":"Matthew gave 6 crackers to each his friends. If he had 36 crackers How many friends did he give crackers to?","14":"In a school there are 135 girls and 214 boys. 496 more girls and 910 more boys joined the school. How many boys are there in the school now?","15":"The school is planning a field trip. The school has 21 classrooms. There are 98 students in the school and 7 school buses. If all buses are full How many seats are in each bus?","16":"There are 10 different books and 6 different movies in the ' crazy silly school ' series. If you read 14 of the movies and watched 19 of the books How many more books than movies have you read?","17":"For the walls of the house he would use 13 large planks of wood. If each plank of wood needs 17 pieces of nails to be secured and in addition 8 nails are needed for some smaller planks. How many nails does John need for the house wall?","18":"Mom buys 70 white t - shirts in total. If white t - shirts can be purchased in packages and mom buys 14 packages How many white t - shirts does each package have?","19":"Jake has 3 fewer peaches and 10 more apples than Steven. Steven has 12 peaches and 15 apples. How many more apples than peaches does Steven have?","20":"Josh had 4 marbles in his collection. He lost 16 marbles and found 8 new ones. How many more marbles did he lose than those he found?","21":"Faye was placing her pencils into 14 rows with 11 pencils in each row. How many pencils does she have?","22":"Lewis earns $ 368 every week during the 1359 weeks of harvest. If he has to pay $ 388 rent every week How much money does he pay as rent during the harvest season?","23":"Winter is almost here and most animals are migrating to warmer countries. There are 18 bird families living near the mountain. If 38 bird families flew away to africa and 80 bird families flew away to asia How many bird families flew away for the winter?","24":"Kelly gives away 91 nintendo games. How many did she have initially if she still has 92 games left?","25":"The Razorback shop makes $ 76 dollars off each jersey and $ 204 off each t-shirt. During the Arkansas and Texas tech game they sold 158 t-shirts and 2 jerseys. How much money did they make from selling the jerseys?","26":"Dan has $ 4. For a total of $ 3 he bought 10 candy bar each one costing the same amount of money. How much money is left?","27":"Lewis earns a total of $ 1216 during the harvest. If he earns $ 16 each week How many weeks did the harvest last?","28":"Danny collects bottle caps. He lost 66 bottle caps at the park. Now he has 25 bottle caps in his collection. How many bottle caps did danny have at first?","29":"Jake has 12 fewer peaches and 79 more apples than Steven. Steven has 19 peaches and 14 apples. How many peaches does Jake have?","30":"A waiter had 12 customers. After some left he still had 14 customers. Then he got 10 new customers How many customers does he have now?","31":"With 28 dollars 2 packs of dvds can be bought. How much does each pack cost?","32":"A waiter had 14 customers. 5 customers left. How many customers does he still have?","33":"Frank was reading through his favorite book. The book had 555 pages equally distributed over 5 chapters. It took Frank 220 days to finish the book. How many pages are in each chapter?","34":"You have 104 dollars. How many packs of dvds can you buy if each pack costs 26 dollars?","35":"Jerry had 4 action figures on a shelf in his room. Later he added some more action figures to the shelf. If there are a total of 8 action figures on his shelf now How many action figures did he add to the shelf?","36":"During summer break 61619 kids from Lawrence county stayed home and the rest went to camp. The total number of kids in Lawrence county is 91676. About how many kids in Lawrence county went to camp?","37":"4 birds and 3 storks were sitting on the fence. 6 more storks came to join them. How many more storks than birds are sitting on the fence?","38":"Marco and his dad went strawberry picking. Together their strawberries weighed 20 pounds. His dad's strawberries weighed 17 pounds. How much did marco's strawberries weigh?","39":"There are 270 students in a school. If the school has 5 students in each grades and each grade has the same number of students How many grades are there in total?","40":"26 children were riding on the bus. At the bus stop 38 more children got on the bus. How many children are on the bus now?","41":"Julia played tag with 17 kids on monday, 15 kids on tuesday and 2 kids on wednesday. How many kids did she play with altogether?","42":"Because of the decision Sofia asked the students to suggest specific types of food. 457 students suggested adding mashed potatoes while others suggested adding bacon to the menu. If 63 more students suggested adding mashed potatoes than those that suggested bacon How many students suggested bacon?","43":"Last week Fred had 86 dollars and Jason had 5 dollars. Fred washed cars over the weekend and now has 9 dollars and Jason did not work. How much money do they have together now?","44":"In a school there are 402 more girls than boys. If there are 739 girls How many boys are there in that school?","45":"After Jessie started to go jogging everyday she lost 126 kilograms. She currently weighs 66 kilograms. How much did she weigh before starting to jog?","46":"Last week Fred had 19 dollars and Jason had 16 dollars. They washed cars over the weekend and now Fred has 40 dollars and Jason has 69 dollars. How much money did Fred earn over the weekend?","47":"Jerry had 7 books and 3 action figures on a shelf in his room. Later he added 2 more action figures to the shelf. How many more books than action figures were on his shelf?","48":"Bobby had 22 pieces of candy. He ate some pieces of candy. Then he ate 5 more. If he still has 8 pieces of candy left How many pieces of candy had he eaten at the start?","49":"Tiffany was collecting cans for recycling. On monday she had 8 bags of cans. She found 10 bags of cans on the next day and 4 bags of cans the day after that. How many bags did she find after monday?","50":"You had 14 bags with equal number of cookies. If you had 28 cookies and 86 candies in total How many bags of cookies do you have?","51":"Helen the hippo and her friends are preparing for thanksgiving at Helen's house. Helen baked 31 cookies yesterday 270 cookies this morning and 419 cookies the day before yesterday. How many cookies did Helen bake till last night?","52":"Danny collects bottle caps and wrappers. He found 11 bottle caps and 28 wrappers at the park. Now he has 68 bottle caps and 51 wrappers in his collection. How many more wrappers than bottle caps did danny find at the park?","53":"Baker made 52 pastries and 84 cakes. If he sold 102 cakes and 94 pastries How many more cakes than pastries did baker make?","54":"Jessie currently weighs 27 kilograms. After she started to go jogging everyday she lost 101 kilograms. How much did she weigh before starting to jog?","55":"Danny collects bottle caps and wrappers. He found 15 bottle caps and 18 wrappers at the park. Now he has 67 wrappers and 35 bottle caps in his collection. How many more wrappers than bottle caps does danny have now?","56":"A grocery store had 72 bottles of regular soda, 32 bottles of diet soda and 78 apples. How many more bottles than apple did they have?","57":"Jack received 6 emails in the morning, 3 emails in the afternoon and 5 emails in the evening. How many emails did Jack receive in the day?","58":"Marco and his dad went strawberry picking. Together they collected strawberries that weighed 24 pounds. On the way back Marco lost 9 pounds of strawberries. Marco's strawberries now weighed 3 pounds. How much did his dad's strawberries weigh?","59":"Jake has 12 fewer peaches than Steven who has 11 more peaches than Jill. Steven has 4 peaches. How many more peaches does Jill have than Jake?","60":"There were 8 people on the bus. At the next stop 12 more people got on the bus and 3 people got off. How many people are there on the bus now?","61":"Tiffany was collecting cans for recycling. On monday she had 8 bags of cans. The next day she found 7 more bags worth of cans. How many more bags did she have on monday than she found on the next day?","62":"They decided to hold the party in their backyard. They have 2 sets of tables, each having the same number of chairs. If there are a total of 12 chairs in the backyard How many chairs are there for each table?","63":"Marco and his dad went strawberry picking. Together their strawberries weighed 35 pounds. Marco's strawberries weighed 13 pounds. How much more did his dad's strawberries weigh than his?","64":"After resting they decided to go for a swim. The depth of the water is 15 times Dean's height. Dean is 4 feet taller than Ron. If Ron stands at 13 feet How deep was the water?","65":"Dan had $ 3 left with him after he bought a candy bar. If he had $ 4 at the start How much did the candy bar cost?","66":"Zachary did 19 push-ups in gym class today. David did 39 more push-ups than Zachary. John did 13 push-ups less than david. How many push-ups did David do?","67":"Each pot has 40 flowers in it. There are 400 flowers in total. How many pots are there in all?","68":"Paul had 134 books. After giving 39 books to his friend and selling some books in a garage sale he had 68 books left. How many books did he sell in the garage sale?","69":"Summer is almost here and most animals are migrating back to cooler countries. There are 87 bird families living near a mountain. If 18 new bird families joined them How many bird families live near the mountain now?","70":"Debby bought 301 water bottles when they were on sale. If she drank 144 bottles a day for some days. If she has 157 bottles left How many days did she drink for?","71":"6 green peaches, 60 yellow peaches and 2 red peaches are in the basket. How many more green peaches than red peaches are in the basket?","72":"There are 4502 skittles in Steven's skittles collection. Steven also has 4276 erasers. If the skittles and erasers are organized into 154 groups How big is each group?","73":"There are 8 different books and 10 different movies in the ' crazy silly school ' series. If you read 19 of the books and watched 61 of the movies How many more movies than books are there in the ' crazy silly school ' series?","74":"Winter is almost here and most animals are migrating to warmer countries. There were 87 bird families living near the mountain. If 7 bird families flew away for winter How many more bird families stayed behind than those that flew away for the winter?","75":"Jack received 5 emails and 6 letters in the morning. He then received 9 emails and 7 letters in the afternoon. How many letters did jack receive in the day?","76":"Zachary did 53 push-ups and 14 crunches in gym class today. David did 17 more push-ups but 10 less crunches than zachary. How many push-ups and crunches did Zachary do?","77":"The grasshopper, the frog and the mouse had a jumping contest. The grasshopper jumped 14 inches. The mouse jumped 16 inches lesser than the frog who jumped 37 inches farther than the grasshopper. How much farther did the mouse jump than the grasshopper?","78":"Jesse's room is 2 feet long and 12 feet wide. If each tile is of size 4 square feet How many tiles does she need to cover the whole floor?","79":"Haley grew 9 trees in her backyard. After a typhoon 4 died. Then she grew 5 more trees. How many trees does she have left?","80":"A mailman has to give 4 pieces of junk mail to each house in each of the 81 blocks. If there are 12 houses in each block How many pieces of junk mail should he give in each block?","81":"Emily is making bead necklaces for her friends. Each necklace takes 8 beads and she has 16 beads. How many necklaces can Emily make?","82":"Danny collects bottle caps and wrappers. He found 71 bottle caps and 24 wrappers at the park. Now he has 28 bottle caps and 16 wrappers in his collection. How many more bottle caps than wrappers does danny have now?","83":"There are 11 baskets of peaches. Each basket has 10 red peaches and 18 green peaches. How many peaches are in the baskets altogether?","84":"Paul had 42 pens and 143 books. After selling some books and pens in a garage sale he had 113 books and 19 pens left. How many pens did he sell in the garage sale?","85":"The grasshopper, the frog and the mouse had a jumping contest. The grasshopper jumped 25 inches. The frog jumped 32 inches farther than the grasshopper and the mouse jumped 26 inches lesser than the frog. How far did the mouse jump?","86":"Every day Ryan spends 7 hours on learning english, 2 hours on learning chinese and 4 hours on learning spanish. How many more hours does he spend on learning english than he does on learning spanish?","87":"Jake has 7 fewer peaches than Steven and 9 more peaches than Jill. Steven has 16 peaches. How many peaches does Jake have?","88":"A mailman gives 2 junk mails to each house in a block. If the mailman has to give 14 pieces of junk mail to each block. How many houses are there in a block?","89":"Paco had 22 sweet cookies and 75 salty cookies. He ate 15 sweet cookies and 54 salty cookies. How many sweet cookies did Paco have left?","90":"Paige was helping her mom plant flowers in 8 flowerbeds. They planted 32 seeds altogether. If they put same number of seeds in each flower bed How many seeds did they plant in each flowerbed?","91":"If you have 14 cookies in total and 7 bags having equal number of cookies How many cookies does each bag have?","92":"Josh had 22 marbles in his collection. Jack gave him 20 marbles. How many marbles does Josh have now?","93":"He then went to see the oranges being harvested. He found out that they harvest 31 sacks of ripe oranges and 24 sacks of unripe oranges per day. How many sacks of unripe oranges will they have after 45 days of harvest?","94":"The ring toss game at the carnival made the same amount of money each day. In total in 30 days they earned 420 dollars. Together with game they earned 22 dollars. How much did ring toss game make per day?","95":"Winter is almost here and most animals are migrating to warmer countries. There are 8 bird families living near the mountain. If 42 bird families flew away to africa and 31 bird families flew away to asia How many more bird families flew away to africa than those that flew away to asia?","96":"Julia played tag with 14 kids on tuesday. If she played tag with 8 more kids on monday than on tuesday How many kids did she play with on monday?","97":"Bryan took a look at his books as well. He has 7 bookshelves with each having the same number of books. If he has a total of 28 books How many books are there in each bookshelf?","98":"Allan brought 5 balloons to the park. If Jake brought 6 more balloons than the number of balloons that Allan brought How many balloons did Jake bring to the park?","99":"The Razorback t-shirt shop sells each t-shirt for $ 51 dollars. During the Arkansas and Texas tech game they offered a discount of $ 8 per t-shirt and sold 130 t-shirts. How much money did they make from selling the t-shirts?","100":"Rachel picked 3 ripe apples from her tree. Now the tree has 2 ripe apples and 27 unripe apples. How many ripe apples did the tree have to begin with?","101":"Paco had 25 cookies. He ate 5 of them. Then he bought 3 more cookies How many more cookies did he eat than those he bought?","102":"Every day Ryan spends 2 hours on learning english, 5 hours on learning chinese and 4 hours on learning spanish. How many more hours does he spend on learning chinese than he does on learning spanish?","103":"Marco and his dad went strawberry picking. Marco's dad's strawberries weighed 11 pounds. If together their strawberries weighed 30 pounds. How much did Marco's strawberries weigh?","104":"Robin's hair was 14 inches long. It grew by 8 inches. Then he cut off 20 inches. How long is his hair now?","105":"He then went to see the oranges being harvested. He found out that they harvest 82 sacks of ripe oranges and 61 sacks of unripe oranges per day. How many sacks of ripe oranges will they have after 25 days of harvest?","106":"There were 22 parents in the program and 676 people in total. How many pupils were present in the program?","107":"Melissa scored 12 points in each game. If she scored a total of 36 points How many games did she play?","108":"Dan has $ 3 left with him after he bought a candy bar for $ 2. How much money did he have initially?","109":"A book has 3 chapters. The first chapter is 66 pages long the second chapter is 35 pages long and the third chapter is 24 pages long. How many pages does the book have altogether?","110":"Robin has some packages of gum. There are 7 pieces in each package. Robin has 6 extra pieces of gum. In all the number of pieces of gums robin has is 41. How many packages does Robin have?","111":"For Gwen's birthday she received 7 dollars. She spent some money and has 5 dollars left with her. How much money did she spend?","112":"Jessie weighed 114 kilograms. After she started to go jogging everyday she lost 50 kilograms in the first week and 60 kilograms in the second week. How much does she weigh now?","113":"There are 4 different books and 17 different movies in the ' crazy silly school ' series. If you read 19 of the books and watched 7 of the movies How many more movies do you still have to watch?","114":"Danny collects bottle caps. He threw away 54 of the old ones at the park while he found 48 bottle caps new ones. Now he has 52 bottle caps in his collection. How many more bottle caps did danny throw away than those he found at the park?","115":"17 red peaches and 16 green peaches are in the basket. How many more red peaches than green peaches are in the basket?","116":"A waiter had 3 customers. After some left he still had 4 customers. How many more customers stayed behind than those that left?","117":"Helen the hippo and her friends are preparing for thanksgiving at Helen's house. Helen baked 519 chocolate chip cookies and 300 raisin cookies yesterday. And she baked 280 raisin cookies and 359 chocolate chip cookies this morning. How many more raisin cookies did Helen bake yesterday compared to today?","118":"Mary is baking a cake. The recipe calls for 10 cups of flour 2 cups of sugar and 80 cups of salt. She already put in 7 cups of flour. How many more cups of flour than cups of sugar does she need to add now?","119":"Dave had 15 apps on his phone. He added 71 new apps. After deleting some he had 14 left. How many more apps did he delete than he added?","120":"During the Arkansas and Texas tech game the Razorback t-shirt shop made $ 60 by selling t-shirts. If they make $ 10 dollars off each t-shirt sold How many t-shirts did they sell?","121":"Matthew gave equal numbers of crackers and cakes to his 28 friends. If he had 13 crackers and 15 cakes initially How many crackers and cakes did each person eat?","122":"Ed had 24 more marbles than Doug. Doug lost 27 of his marbles at the playground while Ed found 9 more marbles. How many more marbles did Ed have than Doug then?","123":"A grocery store had 57 bottles of regular soda, 26 bottles of diet soda and 27 bottles of lite soda. How many bottles did they have total?","124":"Ed had 12 more marbles than Doug. Ed lost 20 of his marbles at the playground. If Ed had 17 marbles How many marbles does Doug have now?","125":"Jack received 6 emails in the morning, 3 emails in the afternoon and some more in the evening. If he received a total of 10 emails in the day How many emails did Jack receive in the afternoon?","126":"Mary is baking a cake. The recipe calls for 12 cups of flour and 5 cups of sugar. She already put in some cups of flour. If she still needs 2 more cups of flour How many cups of flour did she put in?","127":"Marco and his dad went strawberry picking. Together they collected strawberries that weighed 36 pounds. On the way back Marco ' dad lost 8 pounds of strawberries. Marco's strawberries now weighed 12 pounds. How much did his dad's strawberries weigh now?","128":"36 campers went rowing in the morning 13 campers went rowing in the afternoon and 49 campers went rowing in the evening. How many campers went rowing in all?","129":"Baker made 134 pastries and 11 cakes. If he sold 140 cakes and 92 pastries How many more pastries than cakes did baker make?","130":"In Haley's class 4 are boys who love to play marbles. If Haley has 23 marbles and wants to keep 15 marbles for herself How many will each of the boys receive?","131":"Katie had 62 new games and 80 old games. Her friends had 73 new games and 41 old games. How many old games do they have 3","132":"Steven has 18 peaches. Jake has 12 fewer peaches than Steven who has 8 more peaches than Jill. How many peaches does Jill have?","133":"Carol was sending out birthday invitations to her friends. Each package of invitations she bought had 14 invitations in it and she bought 6 packs. Then she bought 11 extra invitations. How many friends can she invite?","134":"Bryan took a look at his books as well. If he has 34 books distributed equally in 2 bookshelves How many books are there in each bookshelf?","135":"Baker made 144 cakes. He sold 71 of them. Then he made 111 more cakes. How many more cakes did baker make than those he sold?","136":"Julia played tag with a total of 18 kids. She played with 4 kids on monday and yet with some more kids on tuesday. How many kids did she play with on tuesday?","137":"After eating a hearty meal they went to see the Buckingham palace. There, Rachel learned that 45 visitors came to the Buckingham palace on the previous day. If 829 people visited the Buckingham palace within the past 85 days How many visitors visited the Buckingham palace on that day?","138":"After Olivia visited a supermarket there were 29 dollars left. If there were 54 dollars in her wallet initially How much did she spend?","139":"The grasshopper and the frog had a jumping contest. The grasshopper jumped 35 inches. The grasshopper jumped 4 inches farther than the frog. How much did they jump altogether?","140":"A grocery store had 79 bottles of regular soda, 53 bottles of diet soda and 42 apples. How many more bottles of regular soda than diet soda did they have?","141":"Robin's hair was 17 inches long. He cut off some inches of her hair. If his hair is now 13 inches long How much of his hair did he cut?","142":"Julia played tag with 9 kids on monday, 7 kids on tuesday and 96 kids on wednesday. How many more kids did she play with on monday than on tuesday?","143":"Dan has $ 4. He had $ 3 left with him after he bought a candy bar. How much did the candy bar cost?","144":"The grasshopper and the frog had a jumping contest. The frog jumped 39 inches and the grasshopper jumped 17 inches. How much farther did the frog jump than the grasshopper?","145":"Last week Fred had 78 dollars and Jason had 31 dollars. Jason delivered newspapers and now has 57 dollars. Fred washed cars over the weekend and now has 90 dollars. How much money did Jason earn by delivering newspapers?","146":"Jerry had 3 books and 4 action figures on a shelf in his room. Later he added 2 more action figures to the shelf. How many more action figures than books were on his shelf?","147":"Bobby had 20 pieces of candy. He ate 34 pieces of candy. Then he ate 18 more. How many pieces of candy did Bobby eat?","148":"Emily is making bead necklaces for her friends. She had 2 beads and she was able to make 32 necklaces. How many beads did each necklace need?","149":"Jesse's rooms are 19 feet long and 18 feet wide. If she has 20 rooms in all How much carpet does she need to cover the floors of all rooms?","150":"Emily is making bead necklaces for her 43 friends. She had 20 beads and she was able to make 5 necklaces. How many beads did each necklace need?","151":"Lucy went to the grocery store. She bought 10 packs of cookie and 4 packs of cake. How many more packs of cookie did she buy over cake?","152":"Jack received 6 emails in the morning and 2 emails in the afternoon. How many more emails did Jack receive in the morning than in the afternoon?","153":"There are some bananas in Philip's banana collection. If the bananas are organized into 140 groups of size 187 How many bananas does he have in his collection?","154":"Jesse's room is 7 feet wide. If she needs a carpet of size 14 square feet What is the length of her room?","155":"3 birds and 4 storks were sitting on the fence. 6 more storks came to join them. How many birds and storks are sitting on the fence?","156":"Every day Ryan spends a total of 3 hours on learning english and chinese. If he spends 2 hours on learning english everyday How many hours does he spend on learning chinese?","157":"We ordered some pizzas. Each pizza has 2 slices. If there were a total of 28 slices How many pizzas did we order?","158":"Paul got a box of some crayons for his birthday. During the school year he gave 52 crayons to his friends while he lost 535 crayons. If he only had 492 crayons left How many crayons had been lost or given away?","159":"Mary is baking a cake. The recipe calls for 11 cups of sugar and some more cups of flour. She already put in 3 cups of flour. If she still needs to add 6 more cups of flour How many cups of flour did the recipe require?","160":"Baker made 62 cakes. Then he made 149 more cakes. He sold 144 of them. How many cakes would baker still have?","161":"Winter is almost here and most animals are migrating to warmer countries. There are some bird families living near the mountain. 20 bird families flew away for winter while 14 bird families stayed behind. How many bird families were living near the mountain at the start?","162":"Mary is baking a cake. The recipe calls for 12 cups of flour 5 cups of sugar and 49 cups of salt. She already put in 11 cups of flour. How many more cups of flour does she need to add?","163":"A book has 2 chapters across 81 pages. The second chapter is 68 pages long. How many pages are in the second chapter?","164":"Lewis earns $ 403 every week during the 233 weeks of harvest. If he has to pay $ 49 rent every week How much money does he earn during harvest season?","165":"You have read 8 books from the ' crazy silly school ' series. If there are a total of 14 different books in the ' crazy silly school ' series How many more do you still have to read?","166":"Paul got a box of 601 crayons and 406 erasers for his birthday. At the end of the school year he only had 336 crayons left while not having lost a single eraser. How many more erasers than crayons did he have left?","167":"Jack received 3 emails in the afternoon, 6 emails in the morning and some more in the evening. If he received a total of 10 emails in the day How many emails did jack receive in the evening?","168":"Helen the hippo and her friends are preparing for thanksgiving at Helen's house. Helen baked 197 chocolate chip cookies and 46 raisin cookies yesterday. And she baked 75 raisin cookies and 66 chocolate chip cookies this morning. How many more chocolate chip cookies did Helen bake yesterday compared to today?","169":"Jake has 8 fewer peaches and 10 more apples than Steven. Steven has 11 apples and 18 peaches. How many more peaches than apples does Steven have?","170":"Adam has 3 more apples than jackie. Adam has 9 apples. How many apples does Jackie have?","171":"Last week Fred had 111 dollars and Jason had 40 dollars. Fred washed cars over the weekend and now has 115 dollars. Jason delivered newspapers and now has 44 dollars. How much money did they earn by washing cars?","172":"Matthew had 23 crackers. He has 11 crackers left after he gave equal numbers of crackers to his 2 friends. How many crackers did each friend eat?","173":"He then went to see the oranges being harvested. He found out that they harvest 66 sacks per day. How many oranges do they harvest per day if each sack contains 28 oranges?","174":"Debby bought 360 soda bottles and 162 water bottles when they were on sale. If she drank 122 water bottles and 9 soda bottles a day How many days would the soda bottles last?","175":"Faye was placing her pencils and crayons into 7 rows with 36 pencils and 30 crayons in each row. How many crayons does she have?","176":"A book has 2 chapters. The first chapter is 60 pages long. If there are a total of 93 pages in the book How many pages are in the second chapter?","177":"Rachel had to complete 2 pages of reading homework and 4 pages of math homework. How many more pages of math homework than reading homework did she have?","178":"Danny has 12 bottle caps in his collection. He found 53 bottle caps at the park. How many bottle caps does he have now?","179":"Robin cut off 20 inches of his hair. If his hair is now 10 inches long How long was his hair before he cut?","180":"The Ferris wheel in paradise park has 18 seats. Each seat can hold 15 people. If 10 seats are broken How many people can ride the Ferris wheel at the same time?","181":"Baker made 155 cakes. If his friend bought 140 cakes from him How many cakes would baker still have?","182":"Emily is making bead necklaces for her friends. She was able to make 6 necklaces and she had 18 beads. How many beads did each necklace need?","183":"Paco had 26 salty cookies and 17 sweet cookies. He ate 14 sweet cookies and 9 salty cookies. How many salty cookies did Paco have left?","184":"28 children were riding on the bus. At the bus stop 82 children got on the bus while some got off the bus. Then there were 30 children altogether on the bus. How many more children got on the bus than those that got off?","185":"He then went to see the oranges being harvested. He found out that they harvest 5 sacks of ripe oranges and 74 sacks of unripe oranges per day. How many more sacks of unripe oranges than ripe oranges are harvested per day?","186":"He then went to see the oranges being harvested. He found out that they harvested 56 sacks of oranges. How many sacks did they harvest per day if they harvested for a total of 14 days?","187":"Each pack of dvds costs 76 dollars. If there is a discount of 25 dollars on each pack How much do you have to pay to buy each pack?","188":"We ordered 7 pizzas. Each pizza has the same number of slices. If there were a total of 14 slices How many slices are there in each pizza?","189":"White t - shirts can be purchased in packages of 53. If mom buys 57 packages of white t - shirts and 34 trousers How many white t - shirts will she have?","190":"Some campers went rowing in the morning while 7 campers went rowing in the afternoon. If a total of 60 campers went rowing that day How many campers went rowing in the morning?","191":"Because of the decision Sofia asked the students to suggest specific types of food. If 324 students suggested adding mashed potatoes 374 suggested adding bacon to the menu and 128 suggested adding tomatoes How many students participated in the suggestion of new food items?","192":"Friends of Katie had 57 games and she had 63 ds games. How many more games does Katie have than her friends?","193":"In Haley's class some boys love to play marbles. If Haley has 10 marbles and she gave 5 marbles to each boy How many boys did she give the marbles to?","194":"There are 10 peaches distributed equally in some baskets. If each basket has 4 red peaches and 6 green peaches How many baskets of peaches are there?","195":"Rachel had to complete 10 pages of math homework. If she had to complete 3 more pages of reading homework than math homework How many pages did she have to complete in all?","196":"The Razorback shop makes $ 62 dollars off each t-shirt and $ 99 off each jersey. During the Arkansas and Texas tech game they sold 183 t-shirts and 31 jerseys. How much money did they make from selling the t-shirts?","197":"Danny collects bottle caps and wrappers. He found 66 wrappers and 39 bottle caps at the park. Now he has 16 bottle caps and 68 wrappers in his collection. How many wrappers did danny have at first?","198":"Jesse's room is 12 feet long and 11 feet wide. How much longer is her room than it is wide?","199":"Stray cats loved eating goldfish in the pond leaving 6 goldfish. Paige had raised 8 goldfish in the pond initially. How many goldfish disappeared?","200":"Jack received a total of 9 emails in the day. If he received 7 emails in the morning and some more in the afternoon How many emails did Jack receive in the afternoon?","201":"A grocery store had 4 bottles of diet soda. If they had 79 more bottles of regular soda than diet soda How many bottles of regular soda did they have?","202":"Josh had 19 marbles in his collection. He lost 11 marbles and found 5 new ones. How many marbles does he have now?","203":"Brenda's mother made 14 cookies for 2 guests. If each of them had the same number of cookies How many did each of them have?","204":"Danny collects bottle caps and wrappers. He found 10 bottle caps and 62 wrappers at the park. Now he has 27 bottle caps and 43 wrappers in his collection. How many more wrappers than bottle caps does danny have now?","205":"Being his favorite, he saved checking on the grapevines for his last stop. He was told by 294 of the pickers that they fill 244 drums of grapes per day and 47 drums of raspberries per day. How many drums of grapes would be filled in 146 days?","206":"4 birds and 6 storks were sitting on the fence. 2 more storks came to join them. How many storks are sitting on the fence?","207":"After eating a hearty meal they went to see the Buckingham palace. There, Rachel learned that 132 visitors came to the Buckingham palace that day. If 406 people visited the Buckingham palace within the past 327 days How many visitors visited the Buckingham palace on the previous day?","208":"Jessie currently weighs 9 kilograms. After she started to go jogging everyday she lost 62 kilograms in the first week and 140 kilograms in the second week. How much did she weigh before starting to jog?","209":"Melissa scored a total of 21 points playing some games. Is she scored 7 points in each game. How many games did she play?","210":"The Razorback t-shirt shop makes $ 106 dollars off each t-shirt sold. During the Arkansas game and the Texas tech game they sold a total of 242 t-shirts. If they sold 115 t-shirts during the Arkansas game How many t-shirts did they sell during the Texas tech game?","211":"There are 17 different movies and 11 different books in the ' crazy silly school ' series. If you read 13 of the books and watched 63 of the movies How many more movies than books are there in the ' crazy silly school ' series?","212":"After eating a hearty meal they went to see the Buckingham palace. There, Rachel learned that 703 visitors came to the Buckingham palace on the previous day. If there were 246 visitors on that day How many visited the Buckingham palace within 25 days?","213":"Rebecca wants to split a collection of eggs into 4 groups. Rebecca has 8 eggs and 6 marbles. How many eggs will each group have?","214":"Dan has $ 2. He bought some candy bar for $ 6 each one costing $ 3. How many candy bar did he buy?","215":"There were 78 dollars in Olivia's wallet. She spent 15 dollars at a supermarket. How much money does she have left?","216":"During summer break 34044 kids from Lawrence county go to camp and the other 134867 kids stay home. An additional 424944 kids from outside the county attended the camp. How many kids in total attended the camp?","217":"Randy has some blocks. He uses 52 blocks to build a tower. If there are 38 blocks left How many blocks did he have at the start?","218":"Paige raised 7 goldfish and 12 catfish in the pond but stray cats loved eating them. Now she has 15 left. How many fishes disappeared?","219":"White t - shirts can be purchased in packages. If mom buys 28 packages which contain 56 white t - shirts in total How many white t - shirts does each package have?","220":"5 red peaches and 11 green peaches are in the basket. How many more green peaches than red peaches are in the basket?","221":"Frank was reading through his favorite book. He read 22 pages per day and it took him 569 days to finish the book. How many pages are there in the book?","222":"In a school there are 632 girls and 410 boys. 465 more girls joined the school. How many more girls than boys does the school have?","223":"For the walls of the house John would use large planks of wood. Each plank needs 2 pieces of nails to be secured and he would use 16 planks. How many nails does John need for the house wall?","224":"Rebecca wants to split a collection of eggs into groups of 20. Rebecca has 5 marbles and 12 eggs. How many more eggs does Rebecca have than marbles?","225":"Haley grew 20 trees in her backyard. After a typhoon 4 trees were left. How many trees died in the typhoon?","226":"Nell collects cards. She had 246 baseball cards and 214 Ace cards. She gave some of her cards to Jeff and now has 404 baseball cards and 495 Ace cards left. How many more Ace cards than baseball cards does Nell have?","227":"Paul had 108 books and 55 pens. After selling some books and pens in a garage sale he had 66 books and 59 pens left. How many books did he sell in the garage sale?","228":"Because of the decision Sofia asked the students to suggest specific types of food. If 228 students suggested adding mashed potatoes 337 suggested adding bacon to the menu and 23 suggested adding tomatoes How many more students suggested bacon than those that suggested tomatoes?","229":"Rachel had to complete 5 pages of math homework and 2 pages of reading homework. How many more pages of math homework than reading homework did she have?","230":"In a school there are 569 girls and 236 boys. How many more girls than boys does the school have?","231":"Baker's friend bought 137 cakes from him. If he had made 169 cakes initially How many cakes would baker still have?","232":"At the zoo, a cage had 95 snakes and 61 alligators. If 64 snakes were hiding How many snakes were not hiding?","233":"Paco had 13 cookies. He ate 2 of them. Then he bought 36 more cookies How many more cookies did he buy than those he ate?","234":"Paco had 17 cookies. He ate 14 cookies and gave 13 of them to his friend. How many more cookies did he eat than those he gave to his friend?","235":"Luke played 177 rounds of a trivia game. If he gained 46 points in each round How many points did he score in the game?","236":"Danny collects bottle caps. He found 63 bottle caps at the park while he threw away 51 old ones. Now he has 33 bottle caps in his collection. How many bottle caps did danny have at first?","237":"Nell collects cards. She had 309 baseball cards and 356 Ace cards. She gave some of her cards to Jeff and now has 415 baseball cards and Ace cards left. How many more baseball cards than Ace cards does Nell have?","238":"15 campers went rowing in the morning. Some more campers went rowing in the afternoon. If a total of 32 campers went rowing that day How many campers went rowing in the afternoon?","239":"Debby drinks 6 bottles a day. If she bought a total of 12 water bottles How many days would they last her?","240":"Allan brought 2 balloons and Jake brought 4 balloons to the park. Allan then bought 3 more balloons at the park. How many more balloons did Allan have than Jake in the park?","241":"There are 896 skittles in Steven's skittles collection. Steven also has 517 erasers and 90 scales. If the skittles are organized into 8 groups How big is each group?","242":"Because of the decision Sofia asked the students to suggest specific types of food. If 257 students suggested adding mashed potatoes 120 suggested adding bacon to the menu and 97 suggested adding tomatoes How many more students suggested mashed potatoes than those that suggested bacon?","243":"After making some pies, chef had 2 apples left. Initially he had 43 apples How many apples did he use?","244":"Jack received 6 emails and 8 letters in the morning. He then received 2 emails and 7 letters in the afternoon. How many more letters did Jack receive in the morning than in the afternoon?","245":"Dave had 59 files and 15 apps on his phone. After deleting some apps and files he had 12 apps and 30 files left. How many apps did he delete?","246":"Being his favorite, he saved checking on the grapevines for his last stop. He was told by 266 of the pickers that they fill 90 drums of grapes in 5 days. How many drums of grapes would be filled in each day?","247":"Julia played tag with 12 kids on monday. She played tag with 14 kids on tuesday. She spent a total of 34 hours to play tag on both days. How many kids did she play with altogether?","248":"Rachel's tree had 4 apples. She picked 2 apples from her tree. Thereafter 3 new apples grew on the tree. How many apples are there on the tree now?","249":"An industrial machine can make 6 shirts a minute. It worked for 5 minutes yesterday and for 12 minutes today. How many shirts did machine make today?","250":"There are 8 different books and 5 different movies in the ' crazy silly school ' series. If you read 19 of the movies and watched 16 of the books How many more movies than books have you read?","251":"Bryan took a look at his books and magazines. If he has 9 books and 46 magazines in each of his 10 bookshelves How many magazines does he have in total?","252":"Paige was helping her mom plant flowers and they put 10 seeds in each flower bed. If they planted 60 seeds altogther How many flower beds did they have?","253":"Next on his checklist is wax to stick the feathers together. If he has 557 g of wax and right now he just needs 17 g Total how many grams of wax do the feathers require?","254":"Lewis earns $ 2 every week during the harvest. If he earns a total of $ 178 How many weeks did the harvest last?","255":"Tiffany was collecting cans for recycling. On monday she had 10 bags of cans. She found 3 bags of cans on the next day and 7 bags of cans the day after that. How many bags did she have altogether?","256":"Adam could fit 10 action figures on each shelf in his room. His room has could hold 8 action figures. How many total shelves did his room have?","257":"43 children were riding on the bus. At the bus stop some children got off the bus. Then there were 21 children left on the bus. How many children got off the bus at the bus stop?","258":"Paco had 6 cookies. He gave 30 cookies to his friend and ate 23 cookies. How many more cookies did he give to his friend than those he ate?","259":"Mary is baking a cake. The recipe calls for 9 cups of flour and 5 cups of sugar. She already put in 3 cups of flour and 62 cups of sugar. How many more cups of flour does she need to add?","260":"Jack received 6 emails in the morning and 8 emails in the afternoon. How many more emails did Jack receive in the afternoon than in the morning?","261":"David did 40 more push-ups but 17 less crunches than Zachary in gym class today. If Zachary did 34 push-ups and 62 crunches How many crunches did David do?","262":"6 packs of dvds can be bought with 120 dollars. How much does each pack cost?","263":"Mary is baking a cake. The recipe calls for 14 cups of flour and 6 cups of sugar. She already put in 5 cups of flour. How many more cups of flour than cups of sugar does she need to add now?","264":"Jake has 5 fewer peaches than Steven. Steven has 18 more peaches than Jill. If Jill has 87 peaches How many more peaches does Jake have than Jill?","265":"Mary is baking a cake. The recipe calls for 12 cups of flour and 13 cups of sugar. She already put in 2 cups of sugar. How many more cups of sugar does she need to add?","266":"The ring toss game at the carnival made 120 dollars in the first 20 days and 66 dollars in the remaining 16 days. How much did they make per day in the first 20 days at the carnival?","267":"In a school there are 902 girls and 811 boys. 44 more girls joined the school. How many girls are there in the school now?","268":"For the walls of the house he would use 12 large planks of wood and 17 small planks. If each large plank of wood needs 14 pieces of nails to be secured and each small plank needs 25 nails. How many planks does John need for the house wall?","269":"During the Arkansas and Texas tech game the Razorback t-shirt shop made $ 215 by selling 5 t-shirts. What is the cost of each t-shirt?","270":"The Ferris wheel in paradise park has 2 small seats and 23 large seats. Each small seat can hold 14 people and large seat can hold 54 people. How many people can ride the Ferris wheel on small seats?","271":"Next on his checklist is wax to stick the feathers together and colors to paint them. He needs a total of 57 g of colors to paint them. He needs 22 g of wax more. If the feathers require a total of 353 g of wax How many grams of wax does he already have?","272":"Paul had 51 books and 106 pens. After selling some books and pens in a garage sale he had 82 books and 14 pens left. How many pens did he sell in the garage sale?","273":"Allan brought 3 balloons and 20 balls while Jake brought 5 balloons and 59 balls to the park. How many balloons did Allan and Jake have in the park?","274":"Baker made 54 cakes. He sold some of them. If he still has 13 cakes left How many cakes did baker sell?","275":"There are 87 oranges and 290 bananas in Philip's collection. If the bananas are organized into 2 groups and oranges are organized into 93 groups How big is each group of bananas?","276":"Faye was placing her pencils into rows with 16 pencils in each row. She had 28 packs of pencils each one having 24 pencils. How many rows could she make?","277":"The grasshopper, the frog and the mouse had a jumping contest. The grasshopper jumped 24 inches. The frog jumped 33 inches farther than the grasshopper and the mouse jumped 5 inches lesser than the frog. How much farther did the mouse jump than the grasshopper?","278":"We ordered 17 pizzas. Each pizza has 4 slices. If there are 25 of us How many slices of pizza are there altogether?","279":"After resting they decided to go for a swim. The depth of the water is 9 times Dean's height. If Ron is 15 feet tall and Dean is 6 feet shorter than Ron How deep was the water?","280":"Julia played tag with 16 kids on monday. If she played tag with 12 more kids on monday than on tuesday How many kids did she play with on tuesday?","281":"Jerry had some action figures on a shelf in his room. Later he added 7 more action figures to the shelf. If there are a total of 10 action figures on his shelf now How many action figures did he have initially on the shelf?","282":"Allan brought 5 balloons. If Allan and Jake brought total of 6 balloons to the park How many balloons did Jake bring to the park?","283":"After eating a hearty meal they went to see the Buckingham palace. There, Rachel learned that 705 visitors came to the Buckingham palace that day. If there were 191 visitors the previous day and 457 visitors the day before that How many more visitors visited the Buckingham palace on that day than on the previous 245 days?","284":"He then went to see the oranges being harvested. He found out that they harvest 25 sacks of unripe oranges and 5 sacks of ripe oranges per day. How many sacks of ripe oranges will they have after 73 days of harvest?","285":"A waiter had 3 customers. After some more arrived he had 8 customers. How many new customers arrived?","286":"Rachel had to complete 5 pages of math homework and yet more pages of reading homework. If she had to complete a total of 7 pages of homework How many pages of reading homework did she have to complete?","287":"They decided to hold the party in their backyard. They have some sets of tables, each having the 3 chairs. If there are a total of 9 chairs in the backyard How many sets of tables do they have?","288":"At the arcade Dave had won some tickets. He used 12 tickets to buy some toys. If he still has 14 tickets left How many tickets did Dave win at the arcade?","289":"He also had 56 aquariums for saltwater animals and 10 aquariums for freshwater animals. Each aquarium has 39 animals in it. How many saltwater animals does Tyler have?","290":"Allan and Jake brought 3 balloons to the park. If Allan brought 2 balloons How many balloons did Jake bring to the park?","291":"There were some birds sitting on the fence. 4 more birds came to join them. If there are a total of 5 birds on the fence now How many birds had been sitting on the fence at the start?","292":"Baker made 99 cakes. He bought 167 new cakes and sold 89 cakes. How many more cakes did baker buy than those he sold?","293":"Carol was sending out birthday invitations to 12 friends. She bought 3 packs each one having the same number of invitations. How many invitations are in each pack?","294":"Josh had 22 marbles in his collection. He found 13 marbles ones while he lost 5 marbles. How many marbles does he have now?","295":"Nell collects baseball cards. She had 242 cards. She gave 136 of her cards to Jeff. How many cards does Nell have left?","296":"Jake brought 6 balloons to the park. If Jake brought 4 more balloons than the number of balloons that Allan brought How many balloons did Allan bring to the park?","297":"A grocery store had 49 bottles of regular soda, 40 bottles of diet soda and 6 bottles of lite soda. How many bottles of regular soda and diet soda did they have altogether?","298":"Rebecca wants to split a collection of eggs into groups of 3. Rebecca has 99 bananas 9 eggs and 27 marbles. How many groups will be created?","299":"Brenda's mother made cookies for guests. Each guest had 2 cookies. If she prepared a total of 10 cookies How many guests did she prepare cookies for?","300":"Frank was reading through his favorite book. The book had 2 chapters each with 405 pages. It took frank 664 days to finish the book. How many chapters did he read per day?","301":"Jake has 18 fewer peaches than Steven who has 13 more peaches than Jill. Steven has 19 peaches. How many peaches does Jill have?","302":"Danny collects bottle caps and wrappers. He found 65 wrappers and 5 bottle caps at the park. Now he has 31 bottle caps and 9 wrappers in his collection. How many more wrappers than bottle caps did danny find at the park?","303":"If Lewis earns a total of $ 460 during 5 weeks of harvest How much money does he earn each week?","304":"There are 142 bananas and 356 oranges in Philip's collection. If the bananas are organized into 47 groups and oranges are organized into 178 groups How big is each group of oranges?","305":"Baker sold 8 cakes. If he had made 40 cakes initially How many more cakes did baker make than those he sold?","306":"Debby bought 95 soda bottles and 180 water bottles when they were on sale. If she drank 15 water bottles and 54 soda bottles a day How many days would the water bottles last?","307":"Nell collects baseball cards. She had 528 cards while Jeff had 11 cards. She gave some of her cards to jeff and now has 252 cards left. How many cards did Nell give to Jeff?","308":"Jake has 3 fewer peaches and 4 more apples than Steven. Steven has 19 apples and 15 peaches. How many more apples than peaches does Steven have?","309":"The ring toss game at the carnival made 382 dollars in the first 44 days and 374 dollars in the remaining 10 days. How much did they make in all?","310":"Marco and his dad went strawberry picking. Marco's strawberries weighed 30 pounds. If together their strawberries weighed 47 pounds. How much more did his strawberries weigh than his dad's?","311":"Baker made 170 cakes. He sold 78 of them and bought 31 new cakes. How many more cakes did baker sell than those he bought?","312":"Adam has 10 apples. Jackie has 2 apples. How many more apples does Adam have than Jackie?","313":"Lewis earns $ 28 every week during the 1091 weeks of harvest. He also earns $ 939 per week for working overtime. If he works overtime every week How much money does he earn during harvest season?","314":"A waiter had 8 customers. After some left he still had 5 customers. Then he got 99 new customers How many customers left?","315":"Paul had 50 books. After buying some in a garage sale he had 151 left. How many books did he buy?","316":"In a school there are 315 girls and 309 boys. There are also 772 teachers How many people are there in that school?","317":"Helen the hippo and her friends are preparing for thanksgiving at Helen's house. Helen baked 90 chocolate chip cookies yesterday and 51 raisin cookies and 484 chocolate chip cookies this morning. How many chocolate chip cookies did Helen bake?","318":"They decided to hold the party in their backyard. If they have 5 sets of tables and each set has 10 chairs How many more chairs than tables do they have?","319":"Katie had 57 new games and 39 old games. Her friends had 34 new games. How many more games does Katie have than her friends?","320":"Julia played tag with 2 kids on monday, 14 kids on tuesday and 16 kids on wednesday. How many kids did she play with on tuesday and wednesday?","321":"Bobby ate 33 pieces of candy. Then he ate 4 more. He also ate 14 pieces of chocolate. How many pieces of candy and chocolate did Bobby eat altogether?","322":"Melissa scored a total of 91 points in 13 games scoring the same for each game. How many points did she score in each game?","323":"He then went to see the oranges being harvested. He found out that they harvest 28 sacks of ripe oranges and 52 sacks of unripe oranges per day. How many sacks of oranges will they have after 26 days of harvest?","324":"The school has 304 grades and each grade has 75 students How many students were there in total?","325":"Paul had 108 books. After selling some books in a garage sale and giving 35 books to his friend he had 62 books left. How many books did he sell in the garage sale?","326":"Randy has 86 blocks. He uses 79 blocks to build a tower and 82 blocks to build a house. How many more blocks did he use to build the house than he did to build the tower?","327":"21 children were riding on the bus. At the bus stop 10 children got off the bus while some more got on the bus. Then there were 16 children altogether on the bus. How many children got on the bus at the bus stop?","328":"Ed had 29 more marbles than Doug. Ed lost 17 of his marbles at the playground. How many more marbles did Ed have than Doug then?","329":"Last week Fred had 47 dollars and Jason had 99 dollars. Over the weekend Fred delivered newspapers earning 111 dollars and washed cars earning 34 dollars. How much money does Fred have now?","330":"Baker made 133 cakes. If he sold 51 of them How many more cakes did baker make than those he sold?","331":"The grasshopper, the frog and the mouse had a jumping contest. The grasshopper jumped 9 inches. The mouse jumped 3 inches lesser than the frog who jumped 33 inches farther than the grasshopper. How far did the mouse jump?","332":"At the stop 13 more people got on the bus. Initially there were 4 people on the bus. How many people are there on the bus now?","333":"Next on his checklist is wax to stick the feathers together. If he currently has 11 g of wax and the feathers require a total of 492 g of wax How many more grams of wax does he need?","334":"Jesse's room is 11 feet long and 15 feet wide. If she already has 16 square feet of carpet How much more carpet does she need to cover the whole floor?","335":"Jake has 6 fewer peaches than Steven. Steven has 18 more peaches than Jill. If jill has 5 peaches How many peaches does Jake have?","336":"The Razorback t-shirt shop makes $ 78 dollars off each t-shirt sold. During the Arkansas game and the Texas tech game they sold a total of 186 t-shirts. If they sold 172 t-shirts during the Arkansas game How much money did they make from selling the t-shirts during the Texas tech game?","337":"Bobby ate 23 pieces of candy. If he initially had 30 pieces of candy How many pieces of candy does he still have left?","338":"Matthew had 14 crackers and 21 cakes. If Matthew gave equal numbers of crackers and cakes to his 7 friends How many crackers and cakes did each person eat?","339":"3 birds and 2 storks were sitting on the fence. 5 more birds came to join them. How many birds and storks are sitting on the fence?","340":"There are 8 different movies and 21 different books in the ' crazy silly school ' series. If you read 7 of the books and watched 4 of the movies How many more movies do you still have to watch?","341":"Jack received 9 emails in the morning, 10 emails in the afternoon and 7 emails in the evening. How many more emails did Jack receive in the morning than in the evening?","342":"Jake has 11 fewer peaches than Steven. If Jake has 17 peaches. How many peaches does Steven have?","343":"Paige was helping her mom plant flowers and together they planted 45 seeds in 9 flowerbeds. If they put same number of seeds in each flower bed How many seeds did they plant in each flowerbed?","344":"Lucy went to the grocery store. She bought 23 packs of cookie and some packs of cake. In total she had 27 packs of grocery How many packs of cake did she buy in all?","345":"Jessie weighed 71 kilograms. After she started to go jogging everyday she lost 20 kilograms. How much does she weigh now?","346":"There are some baskets of peaches. Each basket has 4 red peaches and 3 green peaches. If there are a total of 7 peaches in all baskets How many baskets of peaches are there?","347":"Katie had 81 ds games and her friends had 59 games. How many more games does Katie have than her friends?","348":"Rachel has 52 apple trees. She picked 2 apples from 1 of her trees. Now the tree has 7 apples still on it. How many apples did the tree have to begin with?","349":"Because of the decision Sofia asked the students to suggest specific types of food from a total of 66 choices. If 450 students suggested adding mashed potatoes 38 suggested adding bacon to the menu and the rest did not participate How many students participated in the suggestion of new food items?","350":"Together Adam and Jackie have 12 apples. He has 9 apples more than Adam and Jackie together do. Adam has 8 more apples than Jackie. How many apples does He have?","351":"Paul got a box of 589 crayons for his birthday. During the school year he gave 571 crayons to his friends while he lost 161 crayons. How many more crayons did he give to his friends than those he lost?","352":"Jerry had 9 action figures on a shelf in his room. Later he added 7 more action figures to the shelf. If he also has 10 books on the shelf How many more action figures than books were on his shelf?","353":"David did 56 more push-ups than Zachary in gym class today. If David did 38 push-ups How many push-ups did Zachary and David do altogether?","354":"Melissa played 3 games and scored a total of 81 points scoring the same for each game. How many points did she score in each game?","355":"They decided to hold the party in their backyard. They have 12 sets of tables and each set has 14 chairs. There are also 6 chairs extra. How many chairs do they have for the guests?","356":"Julia played tag with some kids on monday. She played tag with 14 kids on tuesday. If she played with a total of 16 kids How many kids did she play with on monday?","357":"Bobby had 21 pieces of candy. He ate 5 pieces of candy. Then he ate 9 more. How many pieces of candy does he still have left?","358":"Paco had 36 cookies. He gave 14 cookies to his friend and ate 10 cookies. How many cookies did Paco have left?","359":"Frank was reading through his favorite book. The book had 3 chapters, each with the same number of pages. It has a total of 594 pages. It took Frank 607 days to finish the book. How many pages are in each chapter?","360":"In Haley's class 11 are boys who love to play marbles. If Haley gives 9 marbles to each boy How many marbles did she have?","361":"There are a total of 16 peaches in a basket. If there are 13 red peaches and some more green peaches in the basket. How many green peaches are in the basket?","362":"Emily is making bead necklaces for her 44 friends. She made 26 necklaces and each necklace takes 2 beads. How many beads did Emily have?","363":"The Razorback t-shirt shop makes $ 87 dollars off each t-shirt sold. During the Arkansas game and the Texas tech game they sold a total of 95 t-shirts. If they sold 47 t-shirts during the Arkansas game How much money did they make from selling the t-shirts?","364":"After resting they decided to go for a swim. The depth of the water is 2 times Dean's height. Dean is 8 feet shorter than Ron. If Ron stands at 14 feet How deep was the water?","365":"During summer break 610769 kids from Lawrence county go to camp and the other 590796 kids stay home. An additional 22 kids from outside the county attended the camp. About how many kids are in Lawrence county?","366":"Rachel has 4 apple trees. She picked 7 apples from each of her trees. Now the trees have a total 29 apples still on them. How many apples did Rachel pick in all?","367":"Jerry had 4 action figures and 22 books on a shelf in his room. Later he added 6 more action figures to the shelf. How many action figures were on his shelf in all?","368":"Adam has 5 more apples than Jackie. Jackie has 89 oranges and 11 apples. How many apples does Adam have?","369":"Paul got a box of 65 crayons for his birthday. During the school year he gave 213 crayons to his friends while he lost 16 crayons. How many crayons had been lost or given away?","370":"Last week Fred had 114 dollars and Jason had 22 dollars. They washed cars over the weekend and now Fred has 21 dollars and Jason has 78 dollars. How much money did Jason make over the weekend?","371":"He also had 74 aquariums for freshwater animals and 22 aquariums for saltwater animals. Each aquarium has 46 animals in it. How many saltwater animals does Tyler have?","372":"Jerry had 7 action figures and 2 books on a shelf in his room. Later he added 4 more books to the shelf. How many more action figures than books were on his shelf?","373":"For Gwen's birthday she received 5 dollars from her dad. Her mom gave her 2 more dollars. If she spent 6 dollars. How much more money did she receive from her dad than she did from her mom?","374":"Edward spent $ 9. Then he spent $ 8 more. Now he has $ 17. How much did Edward have before he spent his money?","375":"The school is planning a field trip. The school has 66 classrooms. There are 102 students in the school and 8 seats on each school bus. If 22 students do n't want to go for the trip How many buses are needed to take the trip?","376":"Next on his checklist is wax to stick the feathers together and colors to paint them. He needs a total of 49 g of colors to paint them. If the feathers require 288 g of wax and right now he just needs 260 g How many grams of wax does he already have?","377":"An industrial machine can make 3 shirts a minute. It made 4 shirts yesterday and 8 shirts today. How many minutes did the machine work in all?","378":"23 children were riding on the bus. At the bus stop 24 children got on the bus while some got off the bus. Then there were 8 children altogether on the bus. How many more children got off the bus than those that got on?","379":"Emily is making bead necklaces for her friends. She made 11 necklaces and each necklace takes 28 beads. How many beads did Emily have?","380":"Allan brought 5 balloons and Jake brought 3 balloons to the park. How many more balloons did Allan have than Jake in the park?","381":"Paco had 97 salty cookies and 34 sweet cookies. He ate 15 sweet cookies and 56 salty cookies. How many sweet cookies did Paco have left?","382":"The Ferris wheel in paradise park has some seats. Each seat can hold 9 people. If 18 people can ride the wheel at the same time How many seats does the Ferris wheel have?","383":"Nell collects baseball cards. She had 566 cards while Jeff had 234 cards. She gave some of her cards to Jeff and now has 535 cards left. How many cards does Jeff have now?","384":"There are 7 baskets of peaches. Each basket has 10 red peaches and 2 green peaches. How many green peaches are in the baskets altogether?","385":"Jack received 10 emails in the morning, 7 emails in the afternoon and 17 emails in the evening. How many more emails did Jack receive in the morning than in the afternoon?","386":"Every day Ryan spends 6 hours on learning english and 7 hours on learning chinese. If he learns for 5 days How many hours does he spend on learning english and chinese in all?","387":"A grocery store had a total of 30 bottles of which 28 were bottles of regular soda and the rest were bottles of diet soda. How many bottles of diet soda did they have?","388":"An industrial machine made 9 shirts yesterday and 8 shirts today. It can make 2 shirts a minute. How many minutes did the machine work today?","389":"Jake has 7 fewer peaches than Steven who has 14 more peaches than Jill. Steven has 15 peaches. How many peaches does Jake have?","390":"There are 62 different movies and 19 different books in the ' crazy silly school ' series. If you read 4 of the books and watched 34 of the movies How many more books do you still have to read?","391":"An industrial machine made 13 shirts yesterday and 3 shirts today. It can make 8 shirts a minute. How many minutes did the machine work in all?","392":"Dave had 19 apps on his phone. He deleted 5 apps. How many apps are left on his phone?","393":"Winter is almost here and most animals are migrating to warmer countries. There are 41 bird families living near the mountain. If 35 bird families flew away to asia and 62 bird families flew away to africa How many more bird families flew away to africa than those that flew away to asia?","394":"Rachel had to complete 8 pages of math homework. If she had to complete 6 more pages of reading homework than math homework How many pages of reading homework did she have to complete?","395":"Haley grew some trees in her backyard. After a typhoon 5 died. If 12 trees were left How many trees did she grow?","396":"Josh had some marbles in his collection. He lost 21 marbles. If he has 12 marbles now How many marbles did he have in his collection?","397":"Haley has 20 marbles. In her class 2 boys love to play marbles. If she distributes her marbles equally How many will each of the boys receive?","398":"Last week Fred had 33 dollars and Jason had 95 dollars. Over the weekend Fred delivered newspapers earning 16 dollars and washed cars earning 74 dollars. How much money did Fred earn over the weekend?","399":"Baker made 7 cakes and 148 pastries. If he sold 15 cakes and 103 pastries How many pastries would baker still have?","400":"Julia played tag with 11 kids on monday. She played tag with 12 kids on tuesday. How many more kids did she play with on tuesday than on monday?","401":"Rachel picked 4 apples from her tree. If the tree had 7 apples initially. How many apples are still there on the tree?","402":"Dan has $ 4. He bought 99 candy bar for $ 3 each one costing the same amount of money. How much money is left?","403":"Jack received 4 emails in the morning, 5 emails in the afternoon and 8 emails in the evening. How many emails did Jack receive in the afternoon and evening?","404":"Bobby had 32 pieces of candy. He ate some pieces of candy. If he has 20 pieces of candy left How many pieces of candy did Bobby eat?","405":"The Ferris wheel in paradise park has 3 small seats and 7 large seats. Each small seat can hold 16 people and large seat can hold 12 people. How many people can ride the Ferris wheel on large seats?","406":"Allan brought 2 balloons and Jake brought 3 balloons to the park. How many more balloons did Jake have than Allan in the park?","407":"Edward spent $ 16 to buy books and $ 8 to buy pens. Now he has $ 19. How much more did Edward spend on books than pens?","408":"Dave had 17 apps on his phone. After adding some he had 18 left. How many apps did he add?","409":"4 people can ride the Ferris wheel in paradise park at the same time. If each seat on the Ferris wheel can hold 2 people How many seats does the Ferris wheel have?","410":"In a school there are 706 girls and 222 boys. 418 more girls joined the school. How many pupils are there in the school now?","411":"Edward had $ 18. He spent $ 16. How much money does Edward have now?","412":"Paige raised 16 goldfish and 71 catfish in the pond but stray cats loved eating them. Now she has 2 left. How many goldfish disappeared?","413":"Because of the decision Sofia asked 310 students to suggest specific types of food. 185 students suggested adding mashed potatoes while others suggested adding bacon to the menu. How many students suggested bacon?","414":"36 children were riding on the bus. At the bus stop 68 children got off the bus while some more got on the bus. Then there were 12 children altogether on the bus. How many more children got off the bus than those that got on?","415":"Mary is baking a cake. The recipe calls for 5 cups of flour and 14 cups of sugar. She already put in 10 cups of flour and 2 cups of sugar. How many more cups of sugar does she need to add?","416":"There were 15 roses in the vase. Jessica threw away 33 roses from the vase and cut some more new roses from her flower garden to put in the vase. There are now 17 roses in the vase. How many more roses did she cut than those she threw away?","417":"Mary is baking a cake. The recipe calls for 6 cups of sugar and 9 cups of flour. She already put in 2 cups of flour. How many more cups of flour than cups of sugar does she need to add now?","418":"Rachel picked 2 ripe apples from her tree. Now the tree has 7 apples still on it. If 6 of those are ripe and the rest are unripe How many ripe apples did the tree have to begin with?","419":"There were 174 parents in the program and 521 pupils too. How many more pupils were present compared to parents in the program?","420":"A grocery store had 54 bottles of diet soda, 83 bottles of regular soda and 12 apples. How many more bottles of regular soda than diet soda did they have?","421":"Allan brought 3 balloons and Jake brought 5 balloons to the park. Allan then bought 2 more balloons at the park. How many balloons did Allan and Jake have in the park?","422":"The school is planning a field trip. The school has 67 classrooms. There are 66 students in each classroom in the school. If there are 6 seats on each school bus How many buses are needed to take the trip?","423":"The grasshopper, the frog and the mouse had a jumping contest. The grasshopper jumped 39 inches. The grasshopper jumped 19 inches farther than the frog and the mouse jumped 12 inches lesser than the frog. How far did the mouse jump?","424":"Julia played tag with 5 kids on monday. She played tag with some more kids on tuesday. If she played with a total of 15 kids How many kids did she play with on tuesday?","425":"Bobby ate 28 pieces of candy. Then he ate 42 more. He also ate 63 pieces of chocolate. How many pieces of candy did Bobby eat?","426":"In a school there are 458 more girls than boys. If there are 692 girls How many pupils are there in that school?","427":"An industrial machine can make 3 shirts per minute. It made 6 shirts in all. How many minutes was the machine working?","428":"29 campers went rowing and 66 campers went hiking in the morning. 26 campers went rowing in the afternoon. How many more campers went rowing in the morning than in the afternoon?","429":"Marco and his dad went strawberry picking. Together their strawberries weighed 4 pounds. Marco's strawberries weighed 19 pounds. How much more did his strawberries weigh than his dad's?","430":"Tiffany was collecting cans for recycling. On monday she had some bags of cans. The next day she found 4 more bags worth of cans. If she had a total of 8 bags altogether How many bags did she have on monday?","431":"62 campers went rowing in the morning. 39 campers went rowing in the afternoon. How many more campers went rowing in the morning than in the afternoon?","432":"Olivia spent 78 dollars at a supermarket. If she has 33 dollars left with her How much money did she have initially?","433":"There are 2 baskets of peaches. Each basket has 4 red peaches and some more green peaches. If there are a total of 12 peaches in all baskets How many green peaches are in each basket?","434":"Faye was placing her pencils into rows with 5 pencils in each row. If she had 35 pencils and 7 crayons How many rows could she make?","435":"Every day Ryan spends 3 hours on learning english and some more hours on learning chinese. If he spends a total of 4 hours on learning english and chinese everyday How many hours does he spend on learning chinese?","436":"After a typhoon, 2 trees in Haley's backyard died. If she had grown 12 trees initially How many trees does she have left?","437":"Paul got a box of 253 crayons for his birthday. By the end of the school year he had either lost or given away 70 of them. How many crayons did he have left by the end of the school year?","438":"3 birds and 4 storks were sitting on the fence. 2 more birds came to join them. How many more birds than storks are sitting on the fence?","439":"For Gwen's birthday she received 5 dollars from her dad. Her mom gave her 7 more dollars. If she spent 4 dollars. How much more money did she receive from her mom than she did from her dad?","440":"Edward spent $ 6 to buy 2 books each book costing him the same amount of money. Now he has $ 12. How much did each book cost?","441":"The cave is 1218 feet deep and they are already at 849 feet. If they are travelling at speed of 17 How much farther until they reach the end of the cave?","442":"The ring toss game at the carnival made 144 dollars per day. They were at the carnival for 22 days. How much money did they make?","443":"Jack received 6 emails and sent 91 letters in the morning. He then received 2 emails and sent 74 letters in the afternoon. How many emails did Jack receive in the day?","444":"The Razorback t-shirt shop sells each t-shirt for $ 201 dollars. During the Arkansas and Texas tech game they increased the prices by $ 217 per t-shirt and sold 14 t-shirts. How much money did they make from selling the t-shirts?","445":"A waiter had 11 customers. After some left he still had 3 customers. How many more customers left than those that stayed behind?","446":"An industrial machine can make 6 shirts a minute. It worked for 12 minutes yesterday and for 14 shirts today. How many shirts did machine make altogether?","447":"Because of the decision Sofia asked the students to suggest specific types of food. If 144 students suggested adding mashed potatoes 467 suggested adding bacon to the menu and 79 suggested adding tomatoes How many more students suggested mashed potatoes than those that suggested tomatoes?","448":"Allan brought 6 balloons and Jake brought 3 balloons to the park. Jake then bought 4 more balloons at the park. How many more balloons did Jake have than Allan in the park?","449":"The bananas in Philip's collection are organized into 196 groups. If there are a total of 392 bananas in Philip's banana collection How big is each group?","450":"Frank had some pieces of candy. If he put them into 26 bags with 33 pieces in each bag How many pieces of candy did he have?","451":"3 birds were sitting on the fence. 2 more birds and 6 more storks came to join them. How many more storks than birds are sitting on the fence?","452":"A book has 2 chapters. The second chapter is 36 pages long. If there are a total of 67 pages in the book How many pages are in the first chapter?","453":"Bobby had 19 pieces of candy. He ate 2 pieces of candy. How many pieces of candy does he still have left?","454":"Matthew gave equal numbers of crackers to his 18 friends. If he had 36 crackers How many crackers did each person eat?","455":"Bobby ate some pieces of candy. Then he ate 25 more. If he ate a total of 43 pieces of candy How many pieces of candy had he eaten at the start?","456":"The Ferris wheel in paradise park has 4 seats. If 20 people can ride the wheel at the same time How many people can each seat hold?","457":"Paul had 2 books. After selling some in a garage sale he bought 150 new ones. If he has 58 books now How many books did he sell?","458":"Julia played tag with 15 kids on monday, 18 kids on tuesday and 7 kids on wednesday. How many more kids did she play with on monday and tuesday than on wednesday?","459":"There are 14 different movies and 15 different books in the ' crazy silly school ' series. If you read 11 of the books and watched 40 of the movies How many more books than movies are there in the ' crazy silly school ' series?","460":"Paco had 37 sweet cookies and 11 salty cookies. He ate 5 sweet cookies and 2 salty cookies. How many more sweet cookies than salty cookies did he eat?","461":"Steven has 19 peaches. Jake has 12 fewer peaches than Steven and 72 more peaches than Jill. How many peaches does Jake have?","462":"The grasshopper, the frog and the mouse had a jumping contest. The grasshopper jumped 19 inches. The frog jumped 39 inches farther than the grasshopper and the mouse jumped 94 inches lesser than the frog. How far did the frog jump?","463":"Debby bought 153 water bottles when they were on sale. She drank the same number of bottles each day. If the bottles lasted for 17 days How many bottles did she drink each day?","464":"Ed had 19 more marbles than Doug. Ed lost some of his marbles at the playground. Now Ed has 8 more marbles than doug. How many marbles did Ed lose?","465":"David did 51 push-ups in gym class today. David did 49 more push-ups than Zachary. How many push-ups did Zachary and David do altogether?","466":"A farmer had 105 green tomatoes and 71 red tomatoes in his garden. If he picked 137 tomatoes How many tomatoes are left?","467":"Jack received 3 emails and 64 letters in the morning. He then received 5 emails and 54 letters in the afternoon. How many emails did jack receive in the day?","468":"Paul got a box of 457 erasers and 617 crayons for his birthday. At the end of the school year he only had 523 crayons left while not having lost a single eraser. How many more crayons than erasers did he have left?","469":"The grasshopper, the frog and the mouse had a jumping contest. The grasshopper jumped 36 inches. The frog jumped 17 inches farther than the grasshopper and the mouse jumped 15 inches farther than the frog. How far did the frog jump?","470":"Zachary did 15 push-ups in gym class today. David did 39 more push-ups than Zachary. John did 9 push-ups less than David. How many more push-ups did Zachary do than John?","471":"Because of the decision Sofia asked the students to suggest specific types of food. If 479 students suggested adding mashed potatoes while 489 suggested adding bacon to the menu How many more students suggested bacon than those that suggested mashed potatoes?","472":"A farmer had 175 tomatoes and 77 potatoes in his garden. If he picked 172 potatoes How many tomatoes and potatoes does he have left?","473":"Bobby ate 38 pieces of candy. Then he ate 36 more. He also ate 16 pieces of chocolate. How many more pieces of candy than chocolate did Bobby eat?","474":"There were 10 roses in the vase. Jessica cut 8 more roses from her flower garden and put them in the vase. How many roses are there in the vase now?","475":"A grocery store had 81 bottles of regular soda, 60 bottles of diet soda and 60 bottles of lite soda. How many more bottles of regular soda did they have than diet soda?","476":"There are 18 bananas in Philip's banana collection. If the bananas are organized into groups of size 2 How many groups are there?","477":"Every day Ryan spends 6 hours on learning english and 5 hours on learning chinese. If he learns for 2 days How many hours does he spend on learning english in all?","478":"A book has 31 chapters. Each chapter is 61 pages long. How many pages does the book have altogether?","479":"He had 15 aquariums for saltwater animals and 62 aquariums for freshwater animals. Each aquarium has 19 animals in it. How many animals does he have in total?","480":"There were 7 roses in the vase. Jessica cut some more roses from her flower garden which had a total of 59 roses. There are now 20 roses in the vase. How many roses did she cut?","481":"Some children were riding on the bus. At the bus stop 2 more children got on the bus. Then there were 41 children altogether on the bus. How many children were riding on the bus before the bus stop?","482":"Jerry had 7 action figures on a shelf in his room. Later he added some more action figures to the shelf and removed 10 of the old ones. If there are 8 action figures on his shelf now How many action figures did he add to the shelf?","483":"22 children were riding on the bus. At the bus stop 40 children got on the bus while some got off the bus. Then there were 2 children altogether on the bus. How many children got off the bus at the bus stop?","484":"Katie had 84 new games and 19 old games. Her friends had 8 new games and 69 old games. How many new games do they have together?","485":"Jake has 7 fewer peaches than Steven and 8 more peaches than Jill. Steven has 17 peaches. How many peaches does Jill have?","486":"Ed had 6 more marbles than Doug. Doug lost 7 of his marbles at the playground. If Ed had 22 marbles How many marbles does Doug have now?","487":"Paul got a box of 440 crayons for his birthday. During the school year he gave 111 crayons to his friends while he lost 106 crayons. How many crayons did he have left?","488":"The school is planning a field trip. The school has 17 classrooms. There are 46 school buses and a total of 92 students in the school. If all buses are full How many seats are in each bus?","489":"We ordered 9 pizzas. Each pizza has 10 slices. If there are 2 of us How many slices of pizza does each of us get if distributed equally?","490":"Jesse has 18 square feet of carpet. If her room is 4 feet long and 20 feet wide How much more carpet does she need to cover the whole floor?","491":"2 red peaches, 6 yellow peaches and 14 green peaches are in the basket. How many more green peaches than yellow peaches are in the basket?","492":"A book has 2 chapters. The first chapter is 48 pages long. The second chapter is 11 pages long. How many more pages does the first chapter have than the second chapter?","493":"Paco ate 36 cookies. If he had 37 cookies initially How many cookies did Paco have left?","494":"Kelly has 20 nintendo games and 70 sony games. How many nintendo games does she need to give away so that she will have 12 nintendo games left?","495":"Because of the decision Sofia asked the students to suggest specific types of food. 182 students suggested adding mashed potatoes while others suggested adding bacon to the menu. If 166 more students suggested adding bacon than those that suggested mashed potatoes How many students suggested bacon?","496":"Mary is baking a cake. The recipe calls for 9 cups of sugar 14 cups of flour and 40 cups of salt. She already put in 4 cups of flour. How many more cups of flour than cups of sugar does she need to add now?","497":"Being his favorite, he saved checking on the grapevines after 57 stops. He was told by 252 of the pickers that they fill 108 drums of grapes per day. How many drums of grapes would be filled in 58 days?","498":"Nell collects cards. She had 438 baseball cards and 18 Ace cards. She gave some of her cards to Jeff and now has 55 Ace cards and 178 baseball cards left. How many more baseball cards than Ace cards does Nell have?","499":"Jake has 13 fewer peaches and 3 more apples than Steven. Steven has 9 peaches and 8 apples. How many apples does Jake have?","500":"A grocery store had 67 bottles of regular soda and 9 bottles of diet soda. How many more bottles of regular soda than diet soda did they have?","501":"Paul had 21 books. After selling some in a garage sale he bought 42 new ones. If he has 15 books now How many more books did he sell than he bought?","502":"Helen the hippo and her friends are preparing for thanksgiving at Helen's house. Helen baked 144 chocolate chip cookies and 397 raisin cookies yesterday. And she baked 85 raisin cookies and 403 chocolate chip cookies this morning. How many raisin cookies did Helen bake?","503":"Kelly has 106 nintendo games. How many will she have left if she gives away 64 games?","504":"At the zoo, a cage had 93 snakes and 97 alligators. If 40 alligators were hiding How many alligators were not hiding?","505":"Dave had 24 files and 13 apps on his phone. After deleting some apps and files he had 17 apps and 21 files left. How many files did he delete?","506":"Ed had 10 more marbles than Doug. Doug lost 11 of his marbles at the playground. If Ed had 45 marbles How many more marbles did Ed have than Doug then?","507":"Josh had 3 marbles in his collection. He found 6 marbles while he lost 5 marbles. How many more marbles did he find than those he lost?","508":"Kelly has 80 nintendo games. She found 31 more nintendo games. How many does she need to give away so that she will have 6 games left?","509":"Steven has 12 peaches. Jake has 4 fewer peaches than Steven who has 67 more peaches than Jill. How many peaches does Jake have?","510":"If you had 33 cookies and each bag has 11 cookies How many bags of cookies do you have?","511":"The school is planning a field trip. The school has 72 classrooms. There are 3 seats on each school bus. If there are a total of 111 students in the school How many buses are needed to take the trip?","512":"Randy has 37 blocks. He uses 33 blocks to build a tower and 13 blocks to build a house. How many more blocks did he use to build the tower than he did to build the house?","513":"He has 9 apples more than Adam and Jackie together do. Adam and Jackie have 7 apples between them. How many apples does He have?","514":"The grasshopper and the frog had a jumping contest. The grasshopper jumped 31 inches and the frog jumped 35 inches. How much did they jump altogether?","515":"Josh had 7 marbles in his collection. He lost 8 marbles and found 10 new ones. How many more marbles did he find than those he lost?","516":"Zachary did 35 push-ups and 3 crunches in gym class today. David did 58 more push-ups but 87 less crunches than zachary. How many more push-ups than crunches did Zachary do?","517":"Frank was reading through his favorite book. The book had 392 pages and he read 14 pages per day. How many days did he take to finish the book?","518":"Zachary did 44 push-ups in gym class today. David did 58 more push-ups than zachary. How many push-ups did Zachary and David do altogether?","519":"Carol was sending out birthday invitations to 10 friends. If each package of invitations she bought had 2 invitations in it How many packs does she need so that no friend gets left out?","520":"Rachel's tree had 4 apples initially. She picked some apples and now there are 2 apples left on the tree. How many apples did rachel pick?","521":"He then went to see the oranges being harvested. He found out that they harvest 8 sacks per day and that each sack containes 35 oranges. How many oranges do they harvest per day?","522":"Mary is baking a cake. The recipe calls for 9 cups of sugar 7 cups of flour and 4 cups of salt. She already put in 2 cups of flour. How many more cups of flour than cups of salt does she need to add now?","523":"Rachel had to complete 2 pages of math homework, 3 pages of reading homework and 10 more pages of biology homework. How many pages did she have to complete in all?","524":"The Razorback shop makes $ 5 dollars off each jersey and $ 215 off each t-shirt. During the Arkansas and Texas tech game they sold 20 t-shirts and 64 jerseys. How much money did they make from selling the t-shirts?","525":"For Gwen's birthday she received 2 dollars from her mom. Her dad gave her 4 more dollars. If she spent 3 dollars. How much money did she still have?","526":"During summer break 819058 kids from Lawrence county go to camp and the other 668278 kids stay home. How many more kids spent their summer break at the camp compared to those who stayed home?","527":"Next on his checklist is wax to stick the feathers together. If the feathers require 166 g of wax and right now he has 20 g How many more grams of wax does he need?","528":"Edward spent $ 17. Then he received $ 10 from his friend. Now he has $ 7. How much did Edward have before he spent his money?","529":"Mary is baking a cake. The recipe calls for 6 cups of flour and 13 cups of sugar. She already put in some cups of flour. If she still needs 8 more cups of flour than sugar How many more cups of flour does she need to add?","530":"After eating a hearty meal they went to see the Buckingham palace. There, Rachel learned that 317 visitors came to the Buckingham palace that day. If there were 295 visitors the previous day How many more visitors visited the Buckingham palace on that day than on the previous day?","531":"He then went to see the oranges being harvested. He found out that they harvest 41 sacks of unripe oranges and 86 sacks of ripe oranges per day. How many more sacks of ripe oranges than unripe oranges are harvested per day?","532":"Frank was reading through some books. Each book had 249 pages and it took Frank 3 days to finish each book. How many pages did he read per day?","533":"Edward spent $ 6 to buy books and $ 16 to buy pens. Now he has $ 19. How much did Edward have before he spent his money?","534":"Baker made 126 cakes and 48 pastries. If he sold 115 cakes and 81 pastries How many more cakes than pastries did baker make?","535":"Mary is baking a cake. The recipe calls for 12 cups of flour 14 cups of sugar and 7 cups of salt. She already put in 2 cups of flour. How many more cups of flour than cups of salt does she need to add now?","536":"Katie had 91 ds games and her new friends had 88 games and old friends had 53 games. How many games do her friends have in all?","537":"Paul had 115 books. He sold 78 books in a garage sale. How many books does he have left with him?","538":"There are 20 houses in a block. If a mailman has to give 32 pieces of junk mail to each house in each block How many pieces of junk mail should he give each block?","539":"If they are already at 659 feet and the cave is 762 feet deep How much farther until they reach the end of the cave?","540":"Adam could fit 8 action figures and 10 cabinets on each shelf in his room. His room has 4 shelves. How many total items could his shelves hold?","541":"Baker made 14 cakes and 153 pastries. If he sold 8 pastries and 97 cakes How many more cakes than pastries did baker sell?","542":"Matthew had 24 crackers. If Matthew gave equal numbers of crackers to his 3 friends and still had 17 crackers left How many crackers did Matthew give to his friends?","543":"Dan has $ 3. He bought 2 candy bar for $ 4, each one costing the same amount of money. How much did each candy bar cost?","544":"Bobby ate 17 pieces of candy. Then he ate 15 more. If he initially had 36 pieces of candy How many pieces of candy does he still have left?","545":"Mom buys 51 white t - shirts. If white t - shirts can be purchased in packages of 3 How many packages will she have?","546":"Baker made 19 cakes and 131 pastries. If he sold 70 cakes and 88 pastries How many more pastries than cakes did baker make?","547":"Brenda's mother made cookies for 14. If each of them had 30 cookies How many cookies did she prepare?","548":"Rachel had to complete 11 pages of math homework, 2 pages of reading homework and 3 more pages of biology homework. How many more pages of math homework than biology homework did she have?","549":"Paco had 39 sweet cookies and 6 salty cookies. He ate 23 salty cookies and 32 sweet cookies. How many more sweet cookies than salty cookies did he eat?","550":"There are 3941 skittles in Steven's skittles collection. Steven also has 4950 erasers. If the erasers are organized into 495 groups How big is each group?","551":"Nell collects baseball cards. She had 573 cards. She gave 195 cards to John and yet some more to Jeff. Now she has 210 cards left. How many cards did Nell give to Jeff?","552":"After resting they decided to go for a swim. The depth of the water is 16 times Ron's height. Dean is 9 feet taller than Ron. If Ron stands at 13 feet How deep was the water?","553":"Faye was placing 12 pencils equally into 3 rows. How many pencils did she place in each row?","554":"After eating a hearty meal they went to see the Buckingham palace. There, Rachel learned that 100 visitors came to the Buckingham palace on the previous day. If there were 666 visitors on that day How many more visitors visited the Buckingham palace on that day than on the previous day?","555":"There were 5 roses and 3 orchids in the vase. Jessica cut some more roses and orchids from her flower garden. There are now 12 roses and 2 orchids in the vase. How many more roses than orchids are there in the vase now?","556":"Paco had 40 cookies. He ate 5 cookies and gave 13 of them to his friend. How many cookies did paco have left?","557":"A book has 2 chapters across 23 pages. The first chapter is 10 pages long. How many pages are in the first chapter?","558":"Mary is baking a cake. The recipe calls for 11 cups of sugar and 9 cups of flour. She already put in 12 cups of flour and 10 cups of sugar. How many more cups of sugar does she need to add?","559":"The grasshopper, the frog and the mouse had a jumping contest. The grasshopper jumped 19 inches. The grasshopper jumped 4 inches farther than the frog and the mouse jumped 44 inches lesser than the frog. How far did the frog jump?","560":"There are 22 different books and 10 different movies in the ' crazy silly school ' series. If you read 12 of the books and watched 56 of the movies How many more books do you still have to read?","561":"Dave had 17 apps and 21 files on his phone. After deleting some apps and files he had 3 apps and 7 files left. How many files did he delete?","562":"13 campers went rowing and 59 campers went hiking in the morning. 21 campers went rowing in the afternoon. How many campers went rowing in all?","563":"Mary is baking a cake. The recipe calls for 3 cups of sugar 10 cups of flour and 15 cups of salt. She already put in 6 cups of flour. How many more cups of flour does she need to add?","564":"41 campers went rowing and 4 campers went hiking in the morning. 26 campers went rowing in the afternoon. How many campers went rowing and hiking in all?","565":"For the walls of the house he would use 8 large planks of wood. If each plank of wood needs 74 pieces of nails to be secured How many planks does John need for the house wall?","566":"Danny collects bottle caps. He found 36 bottle caps at the park while he threw away 35 old ones. Now he has 22 bottle caps in his collection. How many more bottle caps did danny find at the park than those he threw away?","567":"Baker made 56 pastries and 124 cakes. If he sold 104 cakes and 29 pastries How many pastries would baker still have?","568":"Randy has 90 blocks. He uses 89 blocks to build a house and 63 blocks to build a tower. How many more blocks did he use to build the house than he did to build the tower?","569":"3 birds were sitting on the fence. 6 more storks and 2 more birds came to join them. How many more storks than birds are sitting on the fence?","570":"Danny has 21 bottle caps in his collection. He found some more bottle caps at the park. If he has 53 bottle caps now How many bottle caps did he find at the park?","571":"Baker made 110 cakes. He sold 75 of them. Then he made 76 more cakes. How many cakes would baker still have?","572":"Robin has 43 packages of gum. There are 23 pieces in each package. Robin has 8 extra pieces of gum. How many pieces of gum does Robin have?","573":"He then went to see the oranges being harvested. He found out that they harvest 44 sacks of ripe oranges and 25 sacks of unripe oranges per day. How many more sacks of ripe oranges than unripe oranges are harvested per day?","574":"The ring toss game at the carnival made the same amount of money each day. In total in 5 days they earned 165 dollars. How much did they make per day?","575":"He also had 26 aquariums for saltwater animals. The aquarium had 52 saltwater animals in total and every aquarium had the same number of animals. How many saltwater animals does each aquarium have?","576":"At the zoo, a cage had 3 snakes and 75 alligators. If 82 snakes and 19 alligators were hiding How many alligators were not hiding?","577":"Frank was reading through his favorite book. The book had 193 pages equally distributed over 15 chapters. It took Frank 660 days to finish the book. How many chapters did he read per day?","578":"Baker made 157 cakes and 169 pastries. If he sold 158 cakes and 147 pastries How many more cakes than pastries did baker sell?","579":"Matthew had 8 crackers to give to friends. If Matthew gave 2 crackers to each his friends How many friends did he give crackers to?","580":"At the arcade Dave had won 19 tickets. If he used 12 to buy some toys and 7 more to buy some clothes How many more tickets did Dave use to buy toys than he did to buy clothes?","581":"In a school there are 362 boys and 257 girls. 403 more girls joined the school. How many more girls than boys does the school have?","582":"White t - shirts can be purchased in packages. If mom buys 66 white t - shirts where each package has 3 white t - shirts. How many packages will she have?","583":"Frank was reading through some books. Each book had 66 pages and it took Frank 12 days to finish each book. If he takes 492 days to finish all books How many books did he read?","584":"Jerry had 8 action figures and 9 books on a shelf in his room. Later he added 10 more books to the shelf. How many books were on his shelf in all?","585":"There are 20 different books in the ' crazy silly school ' series. If you are yet to read 5 of the books How many books have you already read?","586":"Frank was reading through his favorite book. He read 8 pages per day. If the book had 576 pages How many days did he take to finish the book?","587":"Danny collects bottle caps. He threw away 6 of the old ones at the park while he found 50 bottle caps new ones. Now he has 60 bottle caps in his collection. How many more bottle caps did danny find at the park than those he threw away?","588":"There were 12 roses and 2 orchids in the vase. Jessica cut some more roses and orchids from her flower garden. There are now 10 roses and 21 orchids in the vase. How many orchids did she cut?","589":"Because of the decision Sofia asked 288 students to suggest specific types of food. 264 students suggested adding bacon while others suggested adding mashed potatoes to the menu. How many students suggested mashed potatoes?","590":"A book has 3 chapters. The first chapter is 35 pages long the second chapter is 18 pages long and the third chapter is 3 pages long. How many more pages does the second chapter have than the third chapter?","591":"A mailman has to give 4 pieces of junk mail to each house in each of the 16 blocks. If there are 17 houses in each block How many pieces of junk mail should he give in total?","592":"There are 11 different books and 17 different movies in the ' crazy silly school ' series. If you read 7 of the books and watched 21 of the movies How many more movies than books have you read?","593":"There are 141 pots. Each pot has 71 flowers and 91 sticks in it. How many flowers are there in all?","594":"There are many different books in the ' crazy silly school ' series. If you have read 13 of the books and are yet to read 8 books How many books are there in the ' crazy silly school ' series?","595":"Being his favorite, he saved checking on the grapevines for his last stop. He was told by 36 of the pickers that they fill 8 drums of grapes per day. How many days will it take to fill 240 drums of grapes?","596":"The Razorback shop makes $ 192 dollars off each t-shirt and $ 34 off each jersey. During the Arkansas and Texas tech game they sold 157 t-shirts and 19 jerseys. How much more does a t-shirt cost than a jersey?","597":"Jake has 3 fewer peaches than Steven who has 8 more peaches than Jill. Steven has 5 peaches. How many more peaches does Jake have than Jill?","598":"Jesse's room is 19 feet wide and 20 feet long. How much longer is her room than it is wide?","599":"Dan has $ 4. He bought a candy bar for $ 7 and a chocolate for $ 6. How much money did he spend buying the candy bar and chocolate?","600":"Baker made 149 cakes and 91 pastries. If he sold 10 cakes and 90 pastries How many cakes would baker still have?","601":"Mary is baking a cake. The recipe calls for 7 cups of sugar and 10 cups of flour. She already put in 4 cups of sugar. How many more cups of sugar does she need to add?","602":"After resting they decided to go for a swim. If the depth of the water is 10 times Dean's height and he stands at 9 feet How much deeper is the water than Dean's height?","603":"There were 21 roses in the vase. Jessica threw away 34 roses from the vase and cut some more new roses from her flower garden to put in the vase. There are now 15 roses in the vase. How many more roses did she throw away than those she cut from her garden?","604":"The school is planning a field trip. The school has 87 classrooms. There are 58 students in the school with each classroom having the same number of students. If there are 2 seats on each school bus. How many buses are needed to take the trip?","605":"Brenda's mother made cookies for guests. If she prepared 38 cookies and each of them had 19 cookies How many guests did she prepare cookies for?","606":"At the arcade Dave had won 7 tickets. He used some tickets to buy toys. If he still has 2 tickets left How many tickets did Dave use to buy toys?","607":"Robin has 28 packages of gum and 13 packages of candy. There are 4 pieces in each package. How many pieces of gum does Robin have?","608":"Paul got a box of some crayons for his birthday. During the school year he gave 563 crayons to his friends while he lost 558 crayons. If he only had 332 crayons left How many crayons did he get for his birthday?","609":"After resting they decided to go for a swim. The depth of the water is 5 times Ron's height. Dean is 11 feet shorter than Ron. If Ron stands at 12 feet How deep was the water?","610":"2 birds and 6 storks were sitting on the fence. 3 more birds came to join them. How many more storks than birds are sitting on the fence?","611":"There were 12 people on the bus. At the next stop 4 more people got on the bus. Each bus can not have more than 36 people. How many people are there on the bus now?","612":"If the cave is 919 feet deep and they need to travel 1307 feet How far is the end of the cave?","613":"Adam has 9 apples. Jackie has 10 apples. How many more apples does Jackie have than Adam?","614":"18 red peaches, 14 yellow peaches and 17 green peaches are in the basket. How many red and yellow peaches are in the basket?","615":"41 children were riding on the bus. At the bus stop some children got off the bus. Then there were 18 children left on the bus. How many more children were on the bus before the bus stop than there are now?","616":"The Ferris wheel in paradise park has 6 seats. Each seat can hold 14 people. If there are 16 people on the wheel right now How many more people can join the wheel?","617":"In a school there are 697 girls and the rest are boys. If there are 228 more girls than boys How many boys are there in that school?","618":"Luke played a trivia game and scored 154 points. If he gained the 11 points in each round How many rounds did he play?","619":"Winter is almost here and most animals are migrating to warmer countries. There are 49 bird families living near the mountain. 59 bird families flew away for winter and 24 new bird families came to live near the mountain from the arctic. How many bird families were left near the mountain?","620":"Debby bought 200 water bottles and 256 soda bottles when they were on sale. If she drank 312 water bottles and 4 soda bottles a day How many days would the soda bottles last?","621":"Dave had 11 apps and 3 files on his phone. After deleting some apps and files he had 24 files and 2 apps left. How many more files than apps does he have left on the phone?","622":"Last week Fred had 49 dollars and Jason had 3 dollars. Fred washed cars over the weekend and now has 112 dollars. Jason delivered newspapers and now has 63 dollars. How much money did Jason earn by delivering newspapers?","623":"Luke gained 146 points in each round of a game. If he played 157 rounds of a trivia game How many points did he score in the game?","624":"Dan has $ 2. He bought a candy bar for $ 6 and a chocolate for $ 3. How much money did he spend to buy candy bar than he did to buy chocolate?","625":"The ring toss game at the carnival made 325 dollars in the first 154 days and 114 dollars in the remaining 57 days. How much did they make per day in the remaining 57 days at the carnival?","626":"Paul had 95 pens and 153 books. After selling some books and pens in a garage sale he had 13 books and 23 pens left. How many books did he sell in the garage sale?","627":"In a school there are 732 girls and 761 boys. 682 more girls and 8 more boys joined the school. How many girls are there in the school now?","628":"Matthew gave equal numbers of crackers and cakes to his 4 friends. If he had 10 crackers and 8 cakes initially How many cakes did each person eat?","629":"44 campers went rowing in the morning 39 campers went rowing in the afternoon and 31 campers went rowing in the evening. How many more campers went rowing in the morning than in the afternoon?","630":"A waiter had 12 customers. While 15 customers left he got 14 new customers. How many customers does he still have?","631":"Paige was helping her mom plant flowers and together they planted 55 seeds. They put 15 seeds in each flower bed and only 60 seeds grew into flowers in each flower bed. How many flowers did they grow?","632":"Jake has 9 fewer peaches than Steven and 18 more peaches than Jill. Steven has 16 peaches. How many more peaches does Steven have than Jill?","633":"Lawrence county has 898051 kids. During summer break 629424 kids go to camp and the rest stay home. How many kids stay home?","634":"After Jessie started to go jogging everyday she lost 35 kilograms. She weighed 69 kilograms before beginning jogging. How much does she weigh now?","635":"Robin cut off 13 inches of his hair. If his hair was 14 inches long initially How long is his hair now?","636":"Bryan took a look at his books and magazines. If he has 27 books and 80 magazines in each of his 23 bookshelves How many books does he have in total?","637":"Tiffany was collecting cans for recycling. On monday she had 4 bags of cans. The next day she found some more bags worth of cans. If she had a total of 6 bags altogether How many bags did she find on the next day?","638":"During summer break 907611 kids from Lawrence county stay home and the other 455682 kids go to camp. About how many kids are in Lawrence county?","639":"He then went to see the oranges being harvested. He found out that they harvest 74 sacks per day and discard 71 of them. How many sacks of oranges will they have after 51 days of harvest?","640":"During summer break 644997 kids from Lawrence county stayed home and the other 893835 kids went to camp. An additional 78 kids from outside the county attended the camp. How many kids are in Lawrence county?","641":"For Gwen's birthday she received 8 dollars from her mom. Her dad gave her 5 more dollars. If she spent 4 dollars. How much more money did she receive from her mom than she did from her dad?","642":"19 red peaches, 11 yellow peaches and 12 green peaches are in the basket. How many more red peaches than yellow peaches are in the basket?","643":"The Razorback shop makes $ 67 dollars off each t-shirt and $ 165 off each jersey. During the Arkansas and Texas tech game they sold 74 t-shirts and 156 jerseys. How much money did they make from selling the jerseys?","644":"Being his favorite, he saved checking on the grapevines for his last stop. He was told by 94 of the pickers that they fill 90 drums of grapes in 6 days. How many drums of grapes would be filled per day?","645":"Jerry had 5 action figures and 9 books on a shelf in his room. Later he added 7 more action figures to the shelf. How many more action figures than books were on his shelf?","646":"After eating a hearty meal they went to see the Buckingham palace. There were 71 paintings in the Buckingham palace. There, Rachel learned that 557 visitors came to the Buckingham palace that day. If there were 188 visitors the previous day How many visited the Buckingham palace within 57 days?","647":"Paco had 40 cookies. He ate 2 of them. Then he bought 37 more cookies How many cookies did Paco have left?","648":"Robin has 28 packages of gum and 14 packages of candy. There are 6 pieces in each package. How many pieces does Robin have?","649":"Allan brought 2 balloons to the park and then bought 3 more balloons there. If Jake brought 6 balloons to the park How many more balloons did Jake have than Allan in the park?","650":"Dan has $ 4. He bought a chocolate for $ 7 and a candy bar for $ 2. How much money did he spend to buy chocolate than he did to buy candy bar?","651":"There are 384 oranges and 192 bananas in Philip's collection. If the bananas are organized into 345 groups and oranges are organized into 16 groups How big is each group of oranges?","652":"There were 100 dollars in Olivia's wallet. She collected 148 more dollars from an atm. After she visited a supermarket there were 159 dollars left. How much did she spend?","653":"David did 44 push-ups in gym class today. David did 9 more push-ups than Zachary. How many push-ups did Zachary do?","654":"A farmer had 171 tomatoes in his garden. If he picked 134 of them yesterday and 30 today. How many will he have left after today?","655":"A grocery store had a total of 17 bottles of which 9 were bottles of regular soda and the rest were bottles of diet soda. They also had 29 apple. How many bottles of diet soda did they have?","656":"At the zoo, a cage had snakes and alligators. The total number of animals in the cage was 79. If 24 snakes and 51 alligators were hiding How many animals were not hiding in all?","657":"There are 16 different books and 14 different movies in the ' crazy silly school ' series. If you read 19 of the books and watched 13 of the movies How many more books than movies are there in the ' crazy silly school ' series?","658":"Adam could fit 11 action figures on each shelf in his room. His room has 4 shelves and 40 cabinets. How many total action figures could his shelves hold?","659":"Matthew had 15 crackers. If Matthew gave equal numbers of crackers to his 5 friends and still had 10 crackers left How many crackers did each friend eat?","660":"Olivia spent 38 dollars at a supermarket. If there were 128 dollars in her wallet initially How much money does she have left?","661":"If each bag has 3 cookies and you had 21 cookies in total How many bags of cookies do you have?","662":"Lewis earns $ 491 every week during the 1181 weeks of harvest. If he has to pay $ 216 rent every week How much money will have at the end of the harvest season?","663":"Mary is baking a cake. The recipe calls for 11 cups of sugar 6 cups of flour and 9 cups of salt. She already put in 12 cups of flour. How many more cups of sugar than cups of salt does she need to add now?","664":"Mary is baking a cake. The recipe calls for 9 cups of flour and 6 cups of sugar. She already put in 4 cups of sugar. How many more cups of flour than cups of sugar does she need to add now?","665":"Baker made 121 cakes. He sold 105 of them and bought 170 new cakes. How many cakes does baker still have?","666":"The Razorback t-shirt shop made $ 51 dollars from selling 3 t-shirt during the Arkansas and Texas tech game they. What is the cost of each t-shirt?","667":"Rachel had to complete 8 pages of math homework. If she had to complete 3 more pages of math homework than reading homework How many pages did she have to complete in all?","668":"The grasshopper and the frog had a jumping contest. The grasshopper jumped 9 inches and the frog jumped 12 inches. How much farther did the frog jump than the grasshopper?","669":"During summer break 202958 kids from Lawrence county go to camp and the other 777622 kids stay home. How many more kids stayed home compared to those who went to the camp?","670":"Jack received 3 emails in the afternoon, 5 emails in the morning and 16 emails in the evening. How many more emails did Jack receive in the morning than in the afternoon?","671":"Rachel had to complete 3 pages of math homework and 4 pages of reading homework. How many more pages of reading homework than math homework did she have?","672":"The school is planning a field trip. The school has 102 classrooms. There are 11 students in the school and 99 seats on each school bus. If 8 students do n't want to go for the trip How many students are going on the trip?","673":"Dan has $ 5. He bought a chocolate for $ 3 and a candy bar for $ 7. How much money did he spend to buy candy bar than he did to buy chocolate?","674":"Each basket of peaches has 19 red peaches and 4 green peaches. If there are 15 such baskets How many peaches are in the baskets altogether?","675":"In a school there are 868 girls and the rest are boys. If there are 281 more girls than boys How many pupils are there in that school?","676":"An industrial machine made 9 shirts yesterday and 44 shirts today. It can make 3 shirts a minute. How many minutes did the machine work yesterday?","677":"You had 26 bags with equal number of cookies. If you had 15 candies and 52 cookies in total How many cookies does each bag have?","678":"Robin's hair was 16 inches long. He cut off 11 inches. Then it again grew by 12 inches. How long is his hair now?","679":"Matthew gave equal numbers of crackers and cakes to his 4 friends. If he had 32 crackers and 98 cakes initially How many crackers did each person eat?","680":"Danny collects bottle caps and wrappers. He found 46 wrappers and 50 bottle caps at the park. Now he has 21 bottle caps and 52 wrappers in his collection. How many more bottle caps than wrappers did danny find at the park?","681":"Paul had some books. After selling 137 in a garage sale he had 105 left. How many books did he have at the start?","682":"A farmer had 177 tomatoes and 12 potatoes in his garden. If he picked 53 tomatoes How many tomatoes and potatoes does he have left?","683":"Paul got a box of some crayons for his birthday. By the end of the school year he only had 291 crayons left since he had either lost or given away 315 of them. How many crayons did he get for his birthday?","684":"Jerry had some action figures on a shelf in his room. Later he added 2 more action figures to the shelf and removed 7 of the old ones. If there are 10 action figures on his shelf now How many action figures did he have initially on the shelf?","685":"Jack received 5 emails in the morning, 8 emails in the afternoon and 72 emails in the evening. How many emails did Jack receive in the morning and afternoon?","686":"Faye was placing some pencils equally into 2 rows. If she had 6 pencils How many pencils did she place in each row?","687":"Paul got a box of some crayons for his birthday. By the end of the school year he had either lost or given away 551 of them and only had 177 left. How many crayons did he get for his birthday?","688":"Allan brought 7 balloons and 5 balls while Jake brought 6 balloons and 4 balls to the park. How many balls did Allan and Jake have in the park?","689":"The grasshopper, the frog and the mouse had a jumping contest. The grasshopper jumped 25 inches. The frog jumped 18 inches farther than the grasshopper and the mouse jumped 2 inches farther than the frog. How far did the mouse jump?","690":"Baker made 173 cakes. He bought 103 new cakes and sold 86 cakes. How many cakes does baker still have?","691":"A book has 2 chapters. The first chapter is 37 pages long. The second chapter is 80 pages long. How many more pages does the second chapter have than the first chapter?","692":"Faye had 31 packs of pencils each one having 6 pencils. She was placing her pencils into rows with 19 pencils in each row. How many pencils does she have?","693":"Rebecca wants to split a collection of marbles into groups of 4. Rebecca has 10 eggs and 20 marbles. How many groups will be created?","694":"The bananas in Philip's collection are organized into groups of size 18. If there are a total of 180 bananas in Philip's banana collection How many groups are there?","695":"2 children were riding on the bus. At the bus stop some more children got on the bus. Then there were 10 children altogether on the bus. How many more children are on the bus now than there were before the bus stop?","696":"They decided to hold the party in their backyard. They have 4 sets of tables and each set has 3 chairs. If a total of 14 people will attend the party How many more chairs will they have to buy?","697":"Every day Ryan spends 6 hours on learning english 7 hours on learning chinese and 3 hours on learning spanish. How many hours does he spend on learning english, chinese and spanish in all?","698":"He then went to see the oranges being harvested. He found out that they harvest 8 sacks per day. How many days will it take to harvest 24 sacks of oranges?","699":"Emily is making bead necklaces for her 72 friends. She has 6 beads and each necklace takes 3 beads. How many necklaces can Emily make?","700":"Matthew had 31 crackers. He has 23 crackers left after he gave equal numbers of crackers to his 5 friends. How many crackers did Matthew give to his friends?","701":"Tiffany was collecting cans for recycling. On monday she had 7 bags of cans. The next day she found 12 more bags worth of cans. How many more bags did she find on the next day than she had on monday?","702":"During summer break 800059 kids from Lawrence county go to camp and the rest stay home. Lawrence county has 828521 kids in all. About how many kids stayed home?","703":"The Razorback t-shirt shop makes $ 98 dollars off each t-shirt sold. During the Arkansas game and the Texas tech game they sold a total of 163 t-shirts. If they sold 89 t-shirts during the Arkansas game How much money did they make from selling the t-shirts during the arkansas game?","704":"Rebecca wants to split a collection of eggs into groups of 5. Rebecca has 20 eggs and 6 marbles. How many more eggs does Rebecca have than marbles?","705":"David did 36 more push-ups but 33 less crunches than Zachary in gym class today. If Zachary did 58 push-ups and 33 crunches How many more push-ups than crunches did Zachary do?","706":"There were 16 roses and 3 orchids in the vase. Jessica cut some more roses and orchids from her flower garden. There are now 7 orchids and 13 roses in the vase. How many orchids did she cut?","707":"He then went to see the oranges being harvested. He found out that they harvest 38 sacks per day and that each sack containes 42 oranges. How many sacks of oranges will they have after 49 days of harvest?","708":"Ryan learns english and chinese for 7 days. Every day he spends 4 hours on learning english and 5 hours on learning chinese. How many hours does he spend on learning english and chinese in all?","709":"Julia played tag with 13 kids on monday and 10 kids on tuesday. She played cards with 15 kids on wednesday. How many kids did she play with altogether?","710":"There were 6 roses and 20 orchids in the vase. Jessica cut some more roses and orchids from her flower garden. There are now 21 orchids and 22 roses in the vase. How many more roses than orchids are there in the vase now?","711":"Dan has $ 7. He bought a candy bar for $ 2 and a chocolate for $ 3. How much money is left?","712":"10 red peaches and some more green peaches are in the basket. If there are a total of 15 peaches in the basket How many green peaches are in the basket?","713":"6 birds and 3 storks were sitting on the fence. 2 more storks came to join them. How many more birds than storks are sitting on the fence?","714":"Julia played tag with 7 kids on monday and 13 kids on tuesday. She played cards wtih 20 kids on wednesday. How many kids did she play tag with altogether?","715":"Next on his checklist is wax to stick the feathers together. He needs 159 g of wax more. If the feathers require a total of 628 g of wax How many grams of wax does he already have?","716":"Bryan took a look at his books as well. If he has a total of 42 books and each bookshelf contains 2 books How many bookshelves does he have?","717":"If each bag has 41 cookies and you had 53 bags of cookies How many cookies would you have?","718":"Rebecca wants to split a collection of eggs into groups of 5. Rebecca has 10 marbles and 15 eggs. How many groups will be created?","719":"Debby bought 88 water bottles and 13 soda bottles when they were on sale. If she drank 4 water bottles and 87 soda bottles a day How many days would the water bottles last?","720":"Every day Ryan spends 6 hours on learning english and 2 hours on learning chinese. How many more hours does he spend on learning english than he does on learning chinese?","721":"Josh had 20 marbles in his collection. He gave 2 marbles to Jack. How many marbles does Josh have now?","722":"In Haley's class some boys love to play marbles. Haley gives 2 marbles to each boy. If she had 28 marbles How many boys did she give the marbles to?","723":"The Razorback shop makes $ 115 dollars off each jersey and $ 25 off each t-shirt. During the Arkansas and Texas tech game they sold 113 t-shirts and 78 jerseys. How much more does a jersey cost than a t-shirt?","724":"A chef had 58 apples. After making some pies, he had used 35. How many apples remained?","725":"Danny collects bottle caps and wrappers. He found 22 bottle caps and 30 wrappers at the park. Now he has 17 bottle caps and 57 wrappers in his collection. How many wrappers did danny have at first?","726":"Rebecca wants to split a collection of eggs into groups of 6. Rebecca has 18 eggs 72 bananas and 66 marbles. How many groups will be created?","727":"There were 61 parents in the program and 177 pupils too. The program could seat 44 people How many people were present in the program?","728":"For Gwen's birthday she received some dollars. She spent 8 dollars and has 6 dollars left with her. How much money did Gwen receive for her birthday?","729":"Debby bought 264 water bottles when they were on sale. If she drank 15 bottles a day for 11 days. How many bottles does she have left?","730":"Paco had 28 cookies. He ate some of them and had 7 cookies left. How many cookies did Paco eat?","731":"Paul got a box of 531 crayons and 38 erasers for his birthday. At the end of the school year he only had 391 left while not having lost a single erasers. How many more crayons than erasers did he have left?","732":"Danny collects bottle caps and wrappers. He found 82 wrappers and 29 bottle caps at the park. Now he has 42 bottle caps and 61 wrappers in his collection. How many bottle caps did danny have at first?","733":"Rachel has 3 apple trees. She picked 8 apples from each of her trees. Now the trees have a total 9 apples still on them. How many apples were there on all trees initially?","734":"Paco had 9 sweet cookies and 6 salty cookies. He ate 36 sweet cookies and 3 salty cookies. How many salty cookies did Paco have left?","735":"For 19 weeks of harvest Lewis earns a total of $ 133. How much money does he earn each week?","736":"Carol was sending out birthday invitations to her friends. Each package of invitations she bought had 10 invitations in it and she bought 7 packs. If she sends invitations to only 2 friends How many invitations will be left?","737":"Matthew had 29 crackers and 30 cakes. If Matthew gave equal numbers of crackers and cakes to his 2 friends How many cakes did each person eat?","738":"Together Adam and Jackie have 6 apples. He has 4 apples more than adam and jackie together do. How many apples does he have?","739":"The Razorback shop makes $ 86 dollars off each t-shirt and $ 232 off each jersey. During the Arkansas and Texas tech game they sold 254 t-shirts and 43 jerseys. How much more does a jersey cost than a t-shirt?","740":"Steven has 14 peaches. Jake has 6 fewer peaches than Steven and 3 more peaches than Jill. How many peaches does Jill have?","741":"Dave had 19 apps and 18 files on his phone. After deleting some apps and files he had 6 apps and 15 files left. How many more files than apps does he have left on the phone?","742":"Frank put 11 pieces of candy in each bag. If he had 22 pieces of candy How many bags would he have?","743":"Paul had 71 books. After selling some in a garage sale he bought 38 new ones. If he has 116 books now How many more books did he buy than he sold?","744":"53 campers went rowing in the morning 48 campers went rowing in the afternoon and 49 campers went rowing in the evening. How many more campers went rowing in the morning than in the evening?","745":"An industrial machine worked for 5 minutes. It can make 4 shirts a minute. How many shirts did machine make?","746":"For the walls of the house he would use 12 large planks of wood and 10 small planks. If large planks together need 15 pieces of nails to be secured and small planks together need 5 nails. How many nails does John need for the house wall?","747":"Zachary did 59 push-ups and 44 crunches in gym class today. David did 19 more push-ups but 27 less crunches than zachary. How many push-ups did David do?","748":"There are 203 bananas and 63 oranges in Philip's collection. If the bananas are organized into 7 groups and oranges are organized into 95 groups How big is each group of bananas?","749":"Every day Ryan spends 6 hours on learning english 3 hours on learning chinese and 58 hours on learning spanish. How many more hours does he spend on learning english than he does on learning chinese?","750":"Haley grew 13 trees in her backyard. After a typhoon 6 died. How many more trees survived the typhoon than those that died?","751":"Ed had 5 more marbles than Doug. Doug lost 3 of his marbles at the playground. If Ed had 27 marbles How many marbles did Doug have initially?","752":"In a school there are 34 girls and 841 boys. How many more boys than girls does the school have?","753":"Baker made 8 cakes. He bought 139 new cakes and sold 145 cakes. How many more cakes did baker sell than those he bought?","754":"The Razorback t-shirt shop makes $ 23 dollars off each t-shirt sold. During the Arkansas and Texas tech game they made $ 230 by selling t-shirts. How many t-shirts did they sell?","755":"Frank had 33 pieces of candy. He lost 24 of them. If he put the remaining pieces into bags with 9 pieces in each bag How many bags would he have?","756":"Katie had 78 new games and 86 old games. Her friends had 48 new games. How many new games do they have together?","757":"6 storks and 2 birds were sitting on the fence. 3 more birds came to join them. How many more storks than birds are sitting on the fence?","758":"Mary is baking a cake. The recipe calls for 11 cups of flour and 7 cups of sugar. She already put in some cups of flour. If she still needs 2 more cups of flour than sugar How many cups of flour did she put in?","759":"There are 10 different books and 11 different movies in the ' crazy silly school ' series. If you read 13 of the books and watched 12 of the movies How many more books than movies have you read?","760":"Mary is baking a cake. The recipe calls for 5 cups of sugar and 13 cups of flour. She already put in some cups of flour. If she still needs 12 more cups of flour How many cups of flour did she put in?","761":"Rachel picked 6 ripe apples from her tree. Now the tree has 2 ripe apples and 4 unripe apples. How many apples did the tree have to begin with?","762":"Rebecca wants to split a collection of eggs into 3 groups. Rebecca has 4 marbles and 15 eggs. How many eggs will each group have?","763":"Brenda's mother made cookies for 10 guests but 9 guests did not come. If she prepared 18 cookies and each guest had the same number of cookies How many did each of them have?","764":"Randy has 97 blocks. He uses some blocks to build a tower. If there are 72 blocks left How many blocks did he use to build the tower?","765":"Emily is making bead necklaces for her friends where each necklace takes 5 beads. She made 4 necklaces. How many beads did Emily have?","766":"Debby bought some water bottles when they were on sale. She drank 109 bottles a day. If the bottles lasted for 74 days How many bottles had she bought?","767":"Jake has 13 more apples and 17 fewer peaches than Steven. Steven has 8 peaches and 12 apples. How many apples does Jake have?","768":"Jerry had 5 action figures and 2 books on a shelf in his room. Later he added 9 more books to the shelf. How many more books than action figures were on his shelf?","769":"Brenda's mother made cookies for 5. She prepared 22 cookies but had to throw away 17 cookies. If each of them had the same number of cookies How many did each of them have?","770":"2 birds were sitting on the fence. Some more birds came to join them. If there are a total of 6 birds on the fence now How many more birds had come to sit on the fence?","771":"After a typhoon, 13 trees in Haley's backyard died. If she had grown 3 trees initially How many more trees died in the typhoon than those that survived?","772":"Jessie weighed 92 kilograms. After she started to go jogging everyday she lost 56 kilograms in the first week and 99 kilograms in the second week. How much did she weigh after the first week of jogging?","773":"Rachel had to complete 7 pages of math homework, 11 pages of reading homework and 8 more pages of biology homework. How many more pages of reading homework than biology homework did she have?","774":"Josh lost 11 marbles. If he had 19 marbles in his collection earlier How many marbles does he have now?","775":"A grocery store had 30 bottles of regular soda, 8 bottles of diet soda and 41 apples. How many bottles did they have total?","776":"Allan brought 5 balloons and Jake brought 4 balloons to the park. Allan then bought 3 more balloons at the park. How many balloons did Allan bring to the park?","777":"Josh had 21 marbles in his collection. He found 7 marbles. How many marbles does he have now?","778":"Winter is almost here and most animals are migrating to warmer countries. 86 bird families flew away for the winter from near a mountain. If there were 45 bird families living near the mountain initially How many more bird families flew away for the winter than those that stayed behind?","779":"Frank was reading through his favorite book. It took him 16 days to finish the book. If the book had 112 pages How many pages did he read per day?","780":"There are 6 houses on a block. If a mailman has to give 24 pieces of junk mail to each block How many pieces of junk mail should he give in each house?","781":"If you had 4 bags with equal number of cookies and 36 cookies in total How many cookies does each bag have?","782":"Nell collects cards. She had 239 baseball cards and 38 Ace cards. She gave some of her cards to Jeff and now has 376 Ace cards and 111 baseball cards left. How many more Ace cards than baseball cards does Nell have?","783":"The grasshopper, the frog and the mouse had a jumping contest. The grasshopper jumped 19 inches. The frog jumped 10 inches farther than the grasshopper and the mouse jumped 20 inches farther than the frog. How much farther did the mouse jump than the grasshopper?","784":"He then went to see the oranges being harvested. He found out that the harvest will go on for 4 days. How many sacks do they harvest per day if they harvested a total of 56 sacks of oranges?","785":"After eating a hearty meal they went to see the Buckingham palace. There, Rachel learned that 512 visitors came to the Buckingham palace that day. If there were 471 visitors the previous day and 808 visitors the day before that How many visited the Buckingham palace within the past 89 days?","786":"Last week Fred had 60 dollars and Jason had 19 dollars. Jason washed cars over the weekend and now has 33 dollars. How much money did Jason make washing cars?","787":"Jack received 10 emails and 12 letters in the morning. He then received 3 emails and 44 letters in the afternoon. How many more emails did Jack receive in the morning than in the afternoon?","788":"Because of the decision Sofia asked the students to suggest specific types of food. If 408 students suggested adding mashed potatoes while 42 suggested adding bacon to the menu How many more students suggested mashed potatoes than those that suggested bacon?","789":"Bryan took a look at his books as well. Each bookshelf contains 2 books. If he has a total of 38 books How many bookshelves does he have?","790":"Winter is almost here and most animals are migrating to warmer countries. There are 85 bird families living near the mountain. If 23 bird families flew away to africa and 37 bird families flew away to asia How many bird families were left near the mountain?","791":"5 storks and 3 birds were sitting on the fence. 4 more birds came to join them. How many more birds than storks are sitting on the fence?","792":"Luke scored 84 points after playing 2 rounds of a trivia game. If he gained the same number of points each round How many points did he score per round?","793":"Edward spent $ 16 to buy 92 books each book costing him the same amount of money. Now he has $ 6. How much did Edward have before he spent his money?","794":"White t - shirts can be purchased in packages of 13. If mom buys 39 white t - shirts How many packages will she have?","795":"Robin has some packages of gum. There are 3 pieces in each package and a total of 42 pieces of gum. How many packages does Robin have?","796":"They decided to hold the party in their backyard. They have 10 sets of tables and each set has 6 chairs. If there are 11 people sitting on chairs How many chairs are left unoccupied?","797":"A farmer had 90 tomatoes in his garden. If he picked 154 of them yesterday and 50 today. How many tomatoes did he pick in all?","798":"Frank put some pieces of candy equally into 2 bags. If he had 16 pieces of candy How many pieces of candy are in each bag?","799":"Faye was placing her pencils and crayons into 11 rows with 31 pencils and 27 crayons in each row. How many pencils and crayons does she have altogether?","800":"Frank was reading through his favorite book. The book had 612 pages equally distributed over 24 chapters. It took Frank 6 days to finish the book. How many pages did he read per day?","801":"Shirley sold 25 cases of boxes of trefoils. How many boxes of trefoils does she need to deliver if each case has 14 boxes?","802":"Paul got a box of 521 crayons and 66 erasers for his birthday. At the end of the school year he only had 154 left while not having lost a single erasers. How many crayons had been lost or given away?","803":"52 campers went rowing in the morning. 61 campers went rowing in the afternoon. How many more campers went rowing in the afternoon than in the morning?","804":"David did 30 more push-ups than Zachary in gym class today. If David did 37 push-ups How many push-ups did Zachary do?","805":"Jack received 3 emails in the morning, 4 emails in the afternoon and 8 emails in the evening. How many emails did Jack receive in the morning and evening?","806":"Mary is baking a cake. The recipe calls for 6 cups of flour 8 cups of sugar and 7 cups of salt. She already put in 5 cups of flour. How many more cups of sugar than cups of salt does she need to add now?","807":"A grocery store had 19 bottles of diet soda and 60 bottles of regular soda. How many more bottles of regular soda than diet soda did they have?","808":"There are 65 baskets of peaches. Each basket has 7 red peaches and 3 green peaches. How many peaches are in each basket?","809":"Dave had 10 apps on his phone. He added 11 new apps. After deleting some he had 4 left. How many apps did he delete?","810":"A book has 3 chapters. The first chapter is 53 pages long the second chapter is 75 pages long and the third chapter is 21 pages long. How many more pages does the first chapter have than the third chapter?","811":"Julia played tag with 14 kids on monday, 2 kids on tuesday and 8 kids on wednesday. How many more kids did she play with on monday than on wednesday?","812":"Because of the decision Sofia asked the students to suggest specific types of food. If 269 students suggested adding bacon 330 suggested adding mashed potatoes to the menu and 76 suggested adding tomatoes How many more students suggested mashed potatoes than those that suggested bacon?","813":"16 people can ride the Ferris wheel in paradise park at the same time. If the Ferris wheel has 4 seats How many people can each seat hold?","814":"Nell collects baseball cards. She gave 301 of her cards to Jeff and now has 154 cards left.. How many cards did Nell have initially?","815":"Mary is baking a cake. The recipe calls for 9 cups of flour and 11 cups of sugar. She already put in 4 cups of flour. How many more cups of sugar than cups of flour does she need to add now?","816":"Dave had 24 apps and 9 files on his phone. After deleting some apps and files he had 5 files and 12 apps left. How many more apps than files does he have left on the phone?","817":"Edward spent $ 4 to buy books and $ 3 to buy pens. Now he has $ 12. How much did Edward spend on books and pens?","818":"For the walls of the house he would use 11 nails in all to secure large planks of wood. If each plank needs 3 pieces of nails to be secured and an additional 8 nails were used. How many planks does John need for the house wall?","819":"Zachary did 51 push-ups and David did 44 push-ups in gym class today. How many more push-ups did Zachary do than David?","820":"Jake has 6 fewer peaches and 8 more apples than Steven. Steven has 17 peaches and 16 apples. How many more peaches than apples does Steven have?","821":"Winter is almost here and most animals are migrating to warmer countries. 27 bird families flew away for the winter from near a mountain. If there were 41 bird families living near the mountain initially How many bird families were left near the mountain?","822":"A school has 485 pupils. There are 232 girls and the rest are boys. How many boys are there in that school?","823":"Mary is baking a cake. The recipe calls for 5 cups of sugar and 14 cups of flour. She already put in 11 cups of flour. How many more cups of sugar than cups of flour does she need to add now?","824":"There were 13 roses and 84 orchids in the vase. Jessica cut some more roses and orchids from her flower garden. There are now 91 orchids and 14 roses in the vase. How many roses did she cut?","825":"There are 466 pots. Each pot has 53 flowers and 181 sticks in it. How many flowers and sticks are there in all?","826":"Dan has $ 5. He bought a candy bar for $ 2 and a chocolate for $ 3. How much money did he spend to buy chocolate than he did to buy candy bar?","827":"Danny collects bottle caps and wrappers. He found 58 bottle caps and 25 wrappers at the park. Now he has 11 wrappers and 12 bottle caps in his collection. How many more bottle caps than wrappers does danny have now?","828":"Paco had 12 cookies. He ate 16 cookies and gave 21 of them to his friend. How many more cookies did he give to his friend than those he ate?","829":"Shirley sold 10 boxes of trefoils. How many boxes are in each case if she needs to deliver 5 cases of boxes?","830":"Jerry had 3 action figures on a shelf in his room. Later he added 4 more action figures to the shelf and removed some of the old ones. If there are 6 action figures on his shelf now How many action figures did he remove from the shelf?","831":"Kelly has 46 nintendo games and 132 sony games. How many sony games does she need to give away so that she will have 31 sony games left?","832":"There were 73 parents, 724 pupils and 744 teachers in the program. How many people were present in the program?","833":"Carol was sending out birthday invitations to her friends. Each package of invitations she bought had 3 invitations in it and she bought 2 packs. If she wants to invite 9 friends How many extra invitations will she need to buy?","834":"Marco and his dad went strawberry picking. His strawberries weighed 8 pounds while his dad's strawberries weighed 32 pounds. Together how much did their strawberries weigh?","835":"A book has 3 chapters. The first chapter is 91 pages long the second chapter is 23 pages long and the third chapter is 25 pages long. How many more pages does the first chapter have than the second chapter?","836":"Jake has 16 fewer peaches than Steven. Steven has 15 more peaches than Jill. If Jill has 12 peaches How many more peaches does Jill have than Jake?","837":"Lucy went to the grocery store. She bought 2 packs of cookie and 12 packs of cake. In the end she had 56 amount of change remaining. How many packs of groceries did she buy in all?","838":"Rebecca wants to split a collection of eggs into groups of 11. If each group has 2 eggs How many eggs does Rebecca have?","839":"Rachel picked 7 ripe apples from her tree. Now the tree has 5 apples still on it. If 3 of those are ripe and the rest are unripe How many unripe apples does the tree have now?","840":"Every day Ryan spends 7 hours on learning english and some more hours on learning chinese. If he spends 2 hours more on learning english than on learning chinese How many hours does he spend on learning chinese?","841":"7 red peaches, 15 yellow peaches and 8 green peaches are in the basket. How many peaches are in the basket?","842":"Allan brought 2 balloons and Jake brought 6 balloons to the park. Allan then bought 3 more balloons at the park. How many more balloons did Jake have than Allan in the park?","843":"For Gwen's birthday she received 3 dollars from her mom. Her dad gave her 6 more dollars. If she spent 4 dollars. How much more money did she receive from her dad than she did from her mom?","844":"Faye had 35 packs of pencils each one having 4 pencils. She was placing her pencils into rows with 2 pencils in each row. How many rows could she make?","845":"Paige was helping her mom plant flowers and together they planted 36 seeds. They put 12 seeds in each flower bed and only 58 seeds grew into flowers in each flower bed. How many flower beds did they have?","846":"There were 3 dollars in Olivia's wallet. She collected 49 more dollars from an atm. After she visited a supermarket there were 49 dollars left. How much more money did she collect at the atm than she spent at the supermarket?","847":"Faye was placing her pencils and crayons into 30 rows with 71 crayons and 24 pencils in each row. How many pencils does she have?","848":"Jesse needs a carpet of size 10 square feet to cover her room. If her room is 5 feet long What is the width of her room?","849":"Dave had 21 apps on his phone. He added 89 new apps. After deleting some he had 24 left. How many more apps did he add than he deleted?","850":"Each pack of dvds costs 107 dollars. If there is a discount of 106 dollars on each pack How many packs of dvds can you buy with 93 dollars?","851":"2 birds were sitting on the fence. 5 more birds and 4 more storks came to join them. How many more birds than storks are sitting on the fence?","852":"Jesse needs a carpet of size 10 square feet to cover her room. If her room is 2 feet wide What is the length of her room?","853":"If each pack costs 81 dollars How much will it cost to buy 33 packs of dvds?","854":"Robin has 21 packages of gum and 45 packages of candy. There are 9 pieces in each package. How many pieces of candies does Robin have?","855":"Haley grew 14 trees in her backyard. After a typhoon 9 died. How many more trees died in the typhoon than those that survived?","856":"5 children were riding on the bus. At the bus stop 63 children got off the bus while some more got on the bus. Then there were 14 children altogether on the bus. How many more children got on the bus than those that got off?","857":"Luke played a trivia game and gained 3 points in each round of a game. If he scored 78 points in the trivia game How many rounds did he play?","858":"7 red peaches, 71 yellow peaches and 8 green peaches are in the basket. How many more green peaches than red peaches are in the basket?","859":"33 campers went rowing in the morning 34 campers went rowing in the afternoon and 10 campers went rowing in the evening. How many more campers went rowing in the afternoon than in the evening?","860":"Marco and his dad went strawberry picking. Together they collected strawberries that weighed 22 pounds. On the way back Marco ' dad found 30 more pounds of strawberries. Marco's strawberries now weighed 36 pounds. How much did his dad's strawberries weigh now?","861":"Melissa scored 109 points in each game. She also got 82 bonus points in each game. How many points did she score in 79 games?","862":"There were 2 roses in the vase. Jessica threw away 4 roses from the vase and cut some more new roses from her flower garden to put in the vase. There are now 23 roses in the vase. How many roses did she cut?","863":"Tiffany was collecting cans for recycling. On monday she had 3 bags of cans. The next day she found 7 more bags of cans and 44 bags of bottles. How many bags of cans did she have altogether?","864":"Every day Ryan spends 4 hours on learning english and 6 hours on learning chinese. If he learns for 86 days How many hours does he spend on learning english and chinese each day?","865":"The school is planning a field trip. The school has 84 classrooms. 95 school buses are fully filled with 118 seats on each school bus. How many students are in the school?","866":"He had a total of 40 saltwater animals in different aquariums. Each aquarium has 2 animals in it. How many aquariums did he have?","867":"Danny collects bottle caps. He threw away 60 of the old ones at the park while he found 58 bottle caps new ones. Now he has 67 bottle caps in his collection. How many bottle caps did danny have at first?","868":"Faye was placing her pencils and crayons into 16 rows with 6 crayons and 21 pencils in each row. How many crayons does she have?","869":"Paige raised 15 goldfish in the pond but stray cats loved eating them. 5 were eaten. How many goldfish remained?","870":"6 birds were sitting on the fence. 4 more birds and 8 more storks came to join them. How many birds are sitting on the fence?","871":"He then went to see the oranges being harvested. He found out that they harvest 65 sacks of unripe oranges and 46 sacks of ripe oranges per day. How many sacks of unripe oranges will they have after 6 days of harvest?","872":"There were 9 roses and 6 orchids in the vase. Jessica cut some more roses and orchids from her flower garden. There are now 13 orchids and 3 roses in the vase. How many more orchids than roses are there in the vase now?","873":"Paige was helping her mom plant flowers and together they planted some seeds. They put 10 seeds in each flower bed. If there are 45 flowerbeds How many seeds did they plant?","874":"Julia played tag with 19 kids on monday. She played tag with 18 kids on tuesday. She spent a total of 38 hours to play tag on both days. How many more kids did she play with on monday than on tuesday?","875":"He then went to see the oranges being harvested. He found out that they harvested 54 sacks of oranges. How many days did it take to harvest them if they harvested 18 sacks of oranges per day?","876":"Lawrence county has 313473 kids. During summer break 274865 kids stay home and the rest go to camp. How many kids go to the camp during the break?","877":"Jesse's room is 7 feet long. If she needs a carpet of size 14 square feet What is the width of her room?","878":"Rachel had to complete 8 pages of math homework, 7 pages of reading homework and 3 more pages of biology homework. How many pages of math and biology homework did she have to complete?","879":"Baker made 54 cakes and 143 pastries. If he sold 68 cakes and 92 pastries How many more pastries than cakes did baker sell?","880":"Julia played tag with 5 kids on monday, 9 kids on tuesday and 15 kids on wednesday. How many kids did she play with on monday and wednesday?","881":"Helen the hippo and her friends are preparing for thanksgiving at Helen's house. Helen baked 527 chocolate chip cookies and 86 raisin cookies yesterday. And she baked 86 raisin cookies and 554 chocolate chip cookies this morning. How many chocolate chip cookies did Helen bake?","882":"Josh had 9 marbles in his collection. He lost some marbles. If he has 4 marbles now How many marbles did he lose?","883":"Frank had 42 pieces of candy. If he put them equally into 2 bags How many pieces of candy are in each bag?","884":"At the arcade Dave had won 18 tickets. If he used 5 to buy some toys and 11 more to buy some clothes How many tickets did Dave have left?","885":"The Razorback shop makes $ 210 dollars off each jersey and $ 240 off each t-shirt. During the Arkansas and Texas tech game they sold 177 t-shirts and 23 jerseys. How much more does a t-shirt cost than a jersey?","886":"He then went to see the oranges being harvested. He found out that they harvest 67 sacks per day and that each sack containes 12 oranges. How many oranges are harvested if they harvest a total of 35 sacks of oranges?","887":"He then went to see the oranges being harvested. He found out that they harvest 16 sacks per day and that each sack containes 57 oranges. How many days will it take to harvest 80 sacks of oranges?","888":"Matthew had some crackers. If Matthew gave 2 crackers to each of his 11 friends How many crackers did Matthew have?","889":"A farmer had 160 tomatoes in his garden. If he picked 56 of them yesterday and 41 today. How many did he have left after yesterday's picking?","890":"A grocery store had 22 bottles of regular soda and 61 bottles of diet soda. How many more bottles of diet soda than regular soda did they have?","891":"Faye was placing her pencils into rows with 22 pencils in each row. She had 6 packs of pencils each one having 14 pencils. How many pencils does she have?","892":"A waiter had 13 customers. After some left he got 4 new customers. If he still had 9 customers How many customers left?","893":"Marco and his dad went strawberry picking. Marco's strawberries weighed 15 pounds. If together their strawberries weighed 37 pounds. How much did his dad's strawberries weigh?","894":"Paco had 40 sweet cookies and 25 salty cookies. He ate 28 salty cookies and 15 sweet cookies. How many more salty cookies than sweet cookies did he eat?","895":"A grocery store had 36 apples, 80 bottles of regular soda and 54 bottles of diet soda. How many more bottles than apple did they have?","896":"A chef had 40 apples and 54 peaches. After making some pies, he had 39 apples left. How many apples did he use?","897":"Zachary did 46 push-ups and 58 crunches in gym class today. David did 38 more push-ups but 62 less crunches than zachary. How many more crunches than push-ups did Zachary do?","898":"Allan brought 6 balloons and Jake brought 2 balloons to the park. Jake then bought 3 more balloons at the park. How many more balloons did Allan have than Jake in the park?","899":"At the stop 8 more people got on the train. Initially there were 11 people on the train. How many people are there on the train now?","900":"Julia played tag with 4 kids on wednesday. She had played with 6 kids on monday and 17 kids on tuesday. How many more kids did she play with on monday than on wednesday?","901":"Randy has 58 blocks. He uses 27 blocks to build a tower and 53 blocks to build a house. How many blocks did he use to build the tower and the house altogether?","902":"After a typhoon, 2 trees in Haley's backyard died. If she had grown 11 trees initially How many more trees survived the typhoon than those that died?","903":"Rachel had to complete 9 pages of math homework, 11 pages of reading homework and 29 more pages of biology homework. How many pages of math and reading homework did she have to complete?","904":"Julia played tag with 15 kids on monday, 18 kids on tuesday and 97 kids on wednesday. How many kids did she play with on monday and tuesday?","905":"Paul sold some books in a garage sale leaving him with 27 books. If he had 136 books initially How many books did he sell?","906":"A mailman has to give 25 pieces of junk mail to each block. If he gives 5 mails to each house in a block How many houses are there in a block?","907":"Jerry had 8 action figures on a shelf in his room. Later he added 4 more action figures to the shelf and removed 5 old ones. How many action figures were on his shelf in all?","908":"Each Ferris wheel in paradise park has 19 seats. Each seat in a Ferris wheel can hold 15 people. How many people can ride 20 Ferris wheels at the same time?","909":"Baker sold 44 cakes. If he had made 48 cakes initially How many cakes would baker still have?","910":"Winter is almost here and most animals are migrating to warmer countries. There are 3 bird families living near the mountain. 26 new bird families came to live near the mountain from the arctic while 2 bird families flew away further south for winter. How many bird families were left near the mountain?","911":"In a school there are 308 girls and 318 boys. There are also 36 teachers How many pupils are there in that school?","912":"5 red peaches, 14 yellow peaches and 6 green peaches are in the basket. How many green and yellow peaches are in the basket?","913":"Winter is almost here and most animals are migrating to warmer countries. There are 38 bird families living near the mountain. If 47 bird families flew away to africa and 94 bird families flew away to asia How many more bird families flew away to asia than those that flew away to africa?","914":"They decided to hold the party in their backyard. They have 14 chairs for each set of table. If they have 9 sets of tables How many more chairs than tables do they have?","915":"Every day Ryan spends 6 hours on learning english and 7 hours on learning chinese. How many more hours does he spend on learning chinese than he does on learning english?","916":"Rachel had to complete 5 pages of math homework, 10 pages of reading homework and 6 more pages of biology homework. How many pages of reading and biology homework did she have to complete?","917":"Paul got a box of 267 crayons for his birthday. During the school year he lost 231 crayons while he gave away 308 crayons to his friends. How many more crayons did he give to his friends than those he lost?","918":"There were 7 roses and 12 orchids in the vase. Jessica cut some more roses and orchids from her flower garden. There are now 11 roses and 20 orchids in the vase. How many more orchids than roses are there in the vase now?","919":"Julia played tag with 5 kids on tuesday. She had played tag with 6 kids on monday. How many more kids did she play with on monday than on tuesday?","920":"Because of the decision Sofia asked the students to suggest specific types of food. If 218 students suggested adding mashed potatoes as well as bacon while 351 suggested adding only bacon to the menu How many students suggested adding bacon?","921":"After finding some bottle caps at the park danny has 32 bottle caps in his collection. If he had 25 bottle caps in his collection earlier How many bottle caps did he find at the park?","922":"Mary is baking a cake. The recipe calls for 12 cups of sugar and 14 cups of flour. She already put in 10 cups of sugar. How many more cups of flour than cups of sugar does she need to add now?","923":"Randy uses 36 blocks to build a tower. If he had 59 blocks How many blocks are left?","924":"Dave had 16 apps and 77 files on his phone. After deleting some apps and files he had 5 apps and 23 files left. How many apps did he delete?","925":"Rachel had to complete 7 pages of math homework. If she had to complete 4 more pages of math homework than reading homework How many pages of reading homework did she have to complete?","926":"Dan has $ 4. He bought a candy bar for $ 8. Then his friend have him $ 5 How much money is left?","927":"Jack received 10 emails in the morning, 5 emails in the afternoon and 4 emails in the evening. How many more emails did Jack receive in the afternoon than in the evening?","928":"Robin's hair was 19 inches long. If he grew 18 more inches How long is his hair now?","929":"After eating a hearty meal they went to see the Buckingham palace. There, Rachel learned that 92 visitors came to the Buckingham palace that day. If there were 419 visitors the previous day and 103 visitors the day before that How many visited the Buckingham palace before that day?","930":"There were 15 roses and 62 orchids in the vase. Jessica cut some more roses and orchids from her flower garden. There are now 17 roses and 96 orchids in the vase. How many roses did she cut?","931":"Mary is baking a cake. The recipe calls for 3 cups of sugar and 10 cups of flour. She already put in some cups of flour. If she still needs 5 more cups of flour than sugar How many cups of flour did she put in?","932":"Josh had 15 marbles in his collection. He found 9 marbles while he lost 23 marbles. How many more marbles did he lose than those he found?","933":"Edward had $ 13. He spent some money. Now he has $ 3. How much money did Edward spend?","934":"Julia played tag with 8 kids on monday, 11 kids on tuesday and 9 kids on wednesday. How many more kids did she play with on tuesday than on wednesday?","935":"46 campers went rowing on a day. 43 campers went rowing in the morning and some more campers went rowing in the afternoon. How many campers went rowing in the afternoon?","936":"Ed had 2 more marbles than Doug. Doug lost some of his marbles at the playground. Now Ed has 19 more marbles than doug. How many marbles did Doug lose?","937":"Paco ate 19 cookies and had 35 cookies left. How many cookies did he have in the beginning?","938":"Lucy went to the grocery store. She bought 4 packs of cookie, 22 packs of cake and 16 packs of chocolate. How many packs of groceries did she buy in all?","939":"Faye was placing her pencils and crayons into 19 rows with 4 pencils and 27 crayons in each row. How many pencils does she have?","940":"Every day Ryan spends 5 hours on learning chinese and some more hours on learning english. If he spends 2 hours more on learning english than on learning chinese How many hours does he spend on learning english?","941":"A mailman has to give 32 pieces of junk mail to each of the 55 blocks. If he gives 8 mails to each house in a block How many houses are there in a block?","942":"Jack received 4 emails and sent 2 letters in the morning. He then received 6 emails and sent 8 letters in the afternoon. How many emails did Jack send in the day?","943":"Helen the hippo and her friends are preparing for thanksgiving at Helen's house. Helen baked 19 chocolate chip cookies yesterday and 231 raisin cookies and 237 chocolate chip cookies this morning. How many more chocolate chip cookies than raisin cakes did Helen bake?","944":"Dave had 15 apps and 24 files on his phone. After deleting some apps and files he had 21 apps and 4 files left. How many more apps than files does he have left on the phone?","945":"Paul got a box of 110 crayons for his birthday. During the school year he gave 90 crayons to his friends while he lost 412 crayons. How many more crayons did he lose than those he gave to his friends?","946":"Bryan took a look at his books and magazines. If he has 23 books and 61 magazines in each of his 29 bookshelves How many books and magazines does he have in total?","947":"There were 106 dollars in Olivia's wallet. After she visited a supermarket and a showroom there were 26 dollars left. If she spent 49 dollars at the showroom How much did she spend at the supermarket?","948":"He then went to see the oranges being harvested. He found out that they harvest 76 sacks per day and discard 64 of them. How many oranges do they harvest per day if each sack contains 50 oranges?","949":"In a school there are 700 girls and the rest are boys. If there are 142 more boys than girls How many pupils are there in that school?","950":"4 birds and 46 storks were sitting on the fence. 6 more birds came to join them. How many birds are sitting on the fence?","951":"At the arcade Dave had won 13 tickets. If he used 8 to buy some toys and 18 more to buy some clothes How many more tickets did Dave use to buy clothes than he did to buy toys?","952":"Zachary did 51 push-ups in gym class today. David did 22 more push-ups than Zachary. John did 4 push-ups less than David. How many push-ups did John do?","953":"Paco had 41 cookies. He gave 9 cookies to his friend and ate 18 cookies. How many more cookies did he eat than those he gave to his friend?","954":"Randy has 95 blocks. He uses 20 blocks to build a house and 50 blocks to build a tower. How many more blocks did he use to build the tower than he did to build the house?","955":"Baker made 81 cakes. Then he made 92 more cakes. He sold 46 of them. How many more cakes did baker make than those he sold?","956":"Dan has $ 3. For a total of $ 4 he bought 2 candy bar each one costing the same amount of money. How much did each candy bar cost?","957":"Frank was reading through his favorite book. The book had 41 chapters, each with the same number of pages. It has a total of 450 pages. It took Frank 30 days to finish the book. How many pages did he read per day?","958":"After eating a hearty meal they went to see the Buckingham palace. There were 39 paintings in the Buckingham palace. There, Rachel learned that 661 visitors came to the Buckingham palace that day. If there were 600 visitors the previous day How many more visitors visited the Buckingham palace on that day than on the previous day?","959":"David did 27 more push-ups but 7 less crunches than Zachary in gym class today. If Zachary did 5 push-ups and 17 crunches How many more crunches than push-ups did Zachary do?","960":"There are 544 pots in each of the 10 gardens. Each pot has 32 flowers in it. How many flowers are there in all?","961":"Jackie has 10 apples. Adam has 8 apples. How many more apples does Jackie have than Adam?","962":"Adam has 4 more apples than Jackie. Together Adam and Jackie have 14 apples. Bob has 6 apples more than Adam and Jackie together do. How many apples does Bob have?","963":"If Lewis earns $ 1357 every week during the 223 weeks of a harvest season. How much money will he earn if he works for 73 harvest seasons?","964":"Dave had some apps on his phone. After deleting 18 of them he had 5 left. How many apps did he have on his phone at the start?","965":"The school is planning a field trip. The school has 24 classrooms. There are 120 students in the school with each classroom having the same number of students. There are 84 seats on each school bus. How many students are in each class?","966":"For the walls of the house he would use 4 nails in all to secure large planks of wood. If each plank of wood needs 2 pieces of nails to be secured How many planks does John need for the house wall?","967":"3 red peaches, and some more green peaches are in the basket. If there are 10 more green peaches than red peaches in the basket How many green peaches are in the basket?","968":"Mary is baking a cake. The recipe calls for 6 cups of sugar and 14 cups of flour. She already put in 7 cups of flour and 60 cups of sugar. How many more cups of flour does she need to add?","969":"There were 53 dollars in Olivia's wallet. She collected 91 more dollars from an atm. After she visited a supermarket there were 14 dollars left. How much more money did she spend at the supermarket than she collected at the atm?","970":"Baker made 61 pastries and 167 cakes. If he sold 108 cakes and 44 pastries How many cakes would baker still have?","971":"There were some roses in the vase. Jessica cut 16 more roses from her flower garden and put them in the vase. There are now 23 roses in the vase. How many roses were there in the vase at the beginning?","972":"There are 6 baskets of peaches. Each basket has 16 red peaches and 18 green peaches. How many red peaches are in the baskets altogether?","973":"A mailman has to give 9 pieces of junk mail to each house in each block. If there are 20 houses on a block How many pieces of junk mail should he give in each block?","974":"Allan brought 5 balloons and Jake brought 6 balloons to the park. Jake then bought 3 more balloons at the park. How many balloons did Jake bring to the park?","975":"Baker made 13 cakes. He sold 91 of them and bought 154 new cakes. How many more cakes did baker buy than those he sold?","976":"6 red peaches, 90 yellow peaches and 16 green peaches are in the basket. How many red and green peaches are in the basket?","977":"He then went to see the oranges being harvested. He found out that they harvest 71 sacks of unripe oranges and 60 sacks of ripe oranges per day. How many more sacks of unripe oranges than ripe oranges are harvested per day?","978":"Rachel had to complete 9 pages of math homework, 2 pages of reading homework and 96 more pages of biology homework. How many more pages of math homework than reading homework did she have?","979":"Jessica cut some roses from her flower garden to put in her vase. There are now 19 roses in the vase. If there were 3 roses in the vase initially How many roses did she cut?","980":"Being his favorite, he saved checking on the grapevines for his last stop. He was told by 235 of the pickers that they fill 100 drums of raspberries per day and 221 drums of grapes per day. How many drums of grapes would be filled in 77 days?","981":"Julia played tag with 18 kids on monday. She played tag with 10 kids on tuesday. How many more kids did she play with on monday than on tuesday?","982":"Lewis earns $ 21 every week during the 216 weeks of harvest. If he has to pay $ 702 tax How much money will have at the end of the harvest season?","983":"A waiter had some customers. After 9 customers left he still had 12 customers. How many customers did he have at the start?","984":"There were 13 roses in the vase. Jessica cut some more roses from her flower garden which had a total of 12 roses. There are now 21 roses in the vase. How many roses are left in the garden?","985":"Jack received 4 emails in the morning and some more in the afternoon. If he received a total of 5 emails in the day How many emails did Jack receive in the afternoon?","986":"Danny collects bottle caps. He found 30 bottle caps at the park while he threw away 63 old ones. Now he has 42 bottle caps in his collection. How many more bottle caps did danny throw away than those he found at the park?","987":"The grasshopper and the frog had a jumping contest. The grasshopper jumped 13 inches. The grasshopper jumped 2 inches farther than the grasshopper. How far did the frog jump?","988":"Zachary did 44 push-ups and 17 crunches in gym class today. David did 29 more push-ups but 13 less crunches than zachary. How many crunches did David do?","989":"In a school there are 635 girls and the rest are boys. If there are 510 more boys than girls How many boys are there in that school?","990":"Ed had 30 more marbles than Doug. Ed lost 21 of his marbles at the playground. If Ed had 91 marbles How many more marbles did Ed have than Doug then?","991":"Every day Ryan spends 5 hours on learning english and 4 hours on learning chinese. If he learns for 6 days How many hours does he spend on learning chinese in all?","992":"The grasshopper, the frog and the mouse had a jumping contest. The grasshopper jumped 21 inches. The grasshopper jumped 25 inches farther than the frog and the mouse jumped 16 inches lesser than the frog. How much farther did the grasshopper jump than the mouse?","993":"He then went to see the oranges being harvested. He found out that they harvest 66 sacks per day and that each sack containes 25 oranges. How many oranges will they have after 87 days of harvest?","994":"Paco had 8 sweet cookies and 6 salty cookies. He ate 20 sweet cookies and 34 salty cookies. How many more salty cookies than sweet cookies did he eat?","995":"Danny collects bottle caps and wrappers. He found 30 bottle caps and 14 wrappers at the park. Now he has 7 bottle caps and 86 wrappers in his collection. How many more bottle caps than wrappers did danny find at the park?","996":"Baker made 43 cakes and 114 pastries. If he sold 154 pastries and 78 cakes How many more pastries than cakes did baker sell?","997":"Randy has 79 blocks. He uses 14 blocks to build a tower and 11 blocks to build a house. How many blocks are left?","998":"Winter is almost here and most animals are migrating to warmer countries. There were 89 bird families living near the mountain. If 60 bird families flew away for winter How many more bird families flew away for the winter than those that stayed behind?"},"answer":{"0":"2","1":"118","2":"2","3":"4","4":"143","5":"3","6":"217","7":"2","8":"6","9":"3","10":"6","11":"11","12":"6","13":"6","14":"1124","15":"14","16":"5","17":"229","18":"5","19":"3","20":"8","21":"154","22":"527292","23":"118","24":"183","25":"152","26":"1","27":"76","28":"91","29":"7","30":"24","31":"14","32":"9","33":"111","34":"4","35":"4","36":"30057","37":"5","38":"3","39":"54","40":"64","41":"34","42":"394","43":"14","44":"337","45":"192","46":"21","47":"2","48":"9","49":"14","50":"2","51":"450","52":"17","53":"32","54":"128","55":"32","56":"26","57":"14","58":"12","59":"1","60":"17","61":"1","62":"6","63":"9","64":"255","65":"1","66":"58","67":"10","68":"27","69":"105","70":"1","71":"4","72":"57","73":"2","74":"73","75":"13","76":"67","77":"21","78":"6","79":"10","80":"48","81":"2","82":"12","83":"308","84":"23","85":"31","86":"3","87":"9","88":"7","89":"7","90":"4","91":"2","92":"42","93":"1080","94":"14","95":"11","96":"22","97":"4","98":"11","99":"5590","100":"5","101":"2","102":"1","103":"19","104":"2","105":"2050","106":"654","107":"3","108":"5","109":"125","110":"5","111":"2","112":"4","113":"10","114":"6","115":"1","116":"5","117":"20","118":"1","119":"1","120":"6","121":"1","122":"60","123":"110","124":"5","125":"1","126":"10","127":"16","128":"98","129":"123","130":"2","131":"121","132":"10","133":"95","134":"17","135":"184","136":"14","137":"784","138":"25","139":"66","140":"26","141":"4","142":"2","143":"1","144":"22","145":"26","146":"3","147":"52","148":"16","149":"6840","150":"4","151":"6","152":"4","153":"26180","154":"2","155":"13","156":"1","157":"14","158":"587","159":"9","160":"67","161":"34","162":"1","163":"13","164":"93899","165":"6","166":"70","167":"1","168":"131","169":"7","170":"6","171":"4","172":"6","173":"1848","174":"40","175":"210","176":"33","177":"2","178":"65","179":"30","180":"120","181":"15","182":"3","183":"17","184":"2","185":"69","186":"4","187":"51","188":"2","189":"3021","190":"53","191":"826","192":"6","193":"2","194":"1","195":"23","196":"11346","197":"2","198":"1","199":"2","200":"2","201":"83","202":"13","203":"7","204":"16","205":"35624","206":"8","207":"274","208":"211","209":"3","210":"127","211":"6","212":"949","213":"2","214":"2","215":"63","216":"458988","217":"90","218":"4","219":"2","220":"6","221":"12518","222":"687","223":"32","224":"7","225":"16","226":"91","227":"42","228":"314","229":"3","230":"333","231":"32","232":"31","233":"34","234":"1","235":"8142","236":"21","237":"266","238":"17","239":"2","240":"1","241":"112","242":"137","243":"41","244":"1","245":"3","246":"18","247":"26","248":"1","249":"72","250":"3","251":"460","252":"6","253":"574","254":"89","255":"20","256":"80","257":"22","258":"7","259":"6","260":"2","261":"45","262":"20","263":"3","264":"13","265":"11","266":"6","267":"946","268":"29","269":"43","270":"28","271":"331","272":"92","273":"8","274":"41","275":"145","276":"42","277":"28","278":"68","279":"81","280":"4","281":"3","282":"1","283":"57","284":"365","285":"5","286":"2","287":"3","288":"26","289":"2184","290":"1","291":"1","292":"78","293":"4","294":"30","295":"106","296":"2","297":"89","298":"3","299":"5","300":"332","301":"6","302":"60","303":"92","304":"2","305":"32","306":"12","307":"276","308":"4","309":"756","310":"13","311":"47","312":"8","313":"1054997","314":"3","315":"101","316":"1396","317":"574","318":"45","319":"62","320":"30","321":"51","322":"7","323":"2080","324":"22800","325":"11","326":"3","327":"5","328":"12","329":"192","330":"82","331":"39","332":"17","333":"481","334":"149","335":"17","336":"1092","337":"7","338":"5","339":"10","340":"4","341":"2","342":"28","343":"5","344":"4","345":"51","346":"1","347":"22","348":"9","349":"488","350":"21","351":"410","352":"6","353":"20","354":"27","355":"174","356":"2","357":"7","358":"12","359":"198","360":"99","361":"3","362":"52","363":"8265","364":"12","365":"1201565","366":"28","367":"10","368":"16","369":"229","370":"56","371":"1012","372":"1","373":"3","374":"34","375":"10","376":"28","377":"4","378":"15","379":"308","380":"2","381":"19","382":"2","383":"265","384":"14","385":"3","386":"65","387":"2","388":"4","389":"8","390":"15","391":"2","392":"14","393":"27","394":"14","395":"17","396":"33","397":"10","398":"90","399":"45","400":"1","401":"3","402":"1","403":"13","404":"12","405":"84","406":"1","407":"8","408":"1","409":"2","410":"1346","411":"2","412":"14","413":"125","414":"24","415":"12","416":"2","417":"1","418":"8","419":"347","420":"29","421":"10","422":"737","423":"8","424":"10","425":"70","426":"926","427":"2","428":"3","429":"34","430":"4","431":"23","432":"111","433":"2","434":"7","435":"1","436":"10","437":"183","438":"1","439":"2","440":"3","441":"369","442":"3168","443":"8","444":"5852","445":"5","446":"156","447":"65","448":"1","449":"2","450":"858","451":"1","452":"31","453":"17","454":"2","455":"18","456":"5","457":"94","458":"26","459":"1","460":"3","461":"7","462":"58","463":"9","464":"11","465":"53","466":"39","467":"8","468":"66","469":"53","470":"30","471":"10","472":"80","473":"58","474":"18","475":"21","476":"9","477":"12","478":"1891","479":"1463","480":"13","481":"39","482":"11","483":"60","484":"92","485":"2","486":"9","487":"223","488":"2","489":"45","490":"62","491":"8","492":"37","493":"1","494":"8","495":"348","496":"1","497":"6264","498":"123","499":"11","500":"58","501":"6","502":"482","503":"42","504":"57","505":"3","506":"21","507":"1","508":"105","509":"8","510":"3","511":"37","512":"20","513":"16","514":"66","515":"2","516":"32","517":"28","518":"146","519":"5","520":"2","521":"280","522":"1","523":"15","524":"4300","525":"3","526":"150780","527":"146","528":"14","529":"21","530":"22","531":"45","532":"83","533":"41","534":"78","535":"3","536":"141","537":"37","538":"640","539":"103","540":"72","541":"89","542":"7","543":"2","544":"4","545":"17","546":"112","547":"420","548":"8","549":"9","550":"10","551":"168","552":"208","553":"4","554":"566","555":"10","556":"22","557":"13","558":"1","559":"15","560":"10","561":"14","562":"34","563":"4","564":"71","565":"8","566":"1","567":"27","568":"26","569":"1","570":"32","571":"111","572":"997","573":"19","574":"33","575":"2","576":"56","577":"44","578":"11","579":"4","580":"5","581":"298","582":"22","583":"41","584":"19","585":"15","586":"72","587":"44","588":"19","589":"24","590":"15","591":"1088","592":"14","593":"10011","594":"21","595":"30","596":"158","597":"5","598":"1","599":"13","600":"139","601":"3","602":"81","603":"6","604":"29","605":"2","606":"5","607":"112","608":"1453","609":"60","610":"1","611":"16","612":"2226","613":"1","614":"32","615":"23","616":"68","617":"469","618":"14","619":"14","620":"64","621":"22","622":"60","623":"22922","624":"3","625":"2","626":"140","627":"1414","628":"2","629":"5","630":"11","631":"220","632":"27","633":"268627","634":"34","635":"1","636":"621","637":"2","638":"1363293","639":"153","640":"1538832","641":"3","642":"8","643":"25740","644":"15","645":"3","646":"745","647":"75","648":"7","649":"1","650":"5","651":"24","652":"89","653":"35","654":"7","655":"8","656":"4","657":"2","658":"44","659":"1","660":"90","661":"7","662":"324775","663":"2","664":"7","665":"186","666":"17","667":"13","668":"3","669":"574664","670":"2","671":"1","672":"3","673":"4","674":"345","675":"1455","676":"3","677":"2","678":"17","679":"8","680":"4","681":"242","682":"136","683":"606","684":"15","685":"13","686":"3","687":"728","688":"9","689":"45","690":"190","691":"43","692":"186","693":"5","694":"10","695":"8","696":"2","697":"16","698":"3","699":"2","700":"8","701":"5","702":"28462","703":"8722","704":"14","705":"25","706":"4","707":"1862","708":"63","709":"38","710":"1","711":"2","712":"5","713":"1","714":"20","715":"469","716":"21","717":"2173","718":"3","719":"22","720":"4","721":"18","722":"14","723":"90","724":"23","725":"27","726":"3","727":"238","728":"14","729":"99","730":"21","731":"353","732":"13","733":"33","734":"3","735":"7","736":"68","737":"15","738":"10","739":"146","740":"5","741":"9","742":"2","743":"45","744":"4","745":"20","746":"20","747":"78","748":"29","749":"3","750":"1","751":"22","752":"807","753":"6","754":"10","755":"1","756":"126","757":"1","758":"2","759":"1","760":"1","761":"12","762":"5","763":"18","764":"25","765":"20","766":"8066","767":"25","768":"6","769":"1","770":"4","771":"23","772":"36","773":"3","774":"8","775":"38","776":"8","777":"28","778":"127","779":"7","780":"4","781":"9","782":"265","783":"30","784":"14","785":"1791","786":"14","787":"7","788":"366","789":"19","790":"25","791":"2","792":"42","793":"22","794":"3","795":"14","796":"49","797":"204","798":"8","799":"638","800":"102","801":"350","802":"367","803":"9","804":"7","805":"11","806":"1","807":"41","808":"10","809":"17","810":"32","811":"6","812":"61","813":"4","814":"455","815":"6","816":"7","817":"7","818":"1","819":"7","820":"1","821":"14","822":"253","823":"2","824":"1","825":"109044","826":"1","827":"1","828":"5","829":"2","830":"1","831":"101","832":"1541","833":"3","834":"40","835":"68","836":"1","837":"14","838":"22","839":"2","840":"5","841":"30","842":"1","843":"3","844":"70","845":"3","846":"46","847":"720","848":"2","849":"3","850":"93","851":"3","852":"5","853":"2673","854":"405","855":"4","856":"9","857":"26","858":"1","859":"24","860":"16","861":"15089","862":"25","863":"10","864":"10","865":"11210","866":"20","867":"69","868":"96","869":"10","870":"10","871":"390","872":"10","873":"450","874":"1","875":"3","876":"38608","877":"2","878":"11","879":"24","880":"20","881":"1081","882":"5","883":"21","884":"2","885":"30","886":"420","887":"5","888":"22","889":"104","890":"39","891":"84","892":"8","893":"22","894":"13","895":"98","896":"1","897":"12","898":"1","899":"19","900":"2","901":"80","902":"7","903":"20","904":"33","905":"109","906":"5","907":"7","908":"5700","909":"4","910":"27","911":"626","912":"20","913":"47","914":"117","915":"1","916":"16","917":"77","918":"9","919":"1","920":"569","921":"7","922":"12","923":"23","924":"11","925":"3","926":"1","927":"1","928":"37","929":"522","930":"2","931":"2","932":"14","933":"10","934":"2","935":"3","936":"17","937":"54","938":"42","939":"76","940":"7","941":"4","942":"10","943":"25","944":"17","945":"322","946":"2436","947":"31","948":"600","949":"1542","950":"10","951":"10","952":"69","953":"9","954":"30","955":"127","956":"2","957":"15","958":"61","959":"12","960":"174080","961":"2","962":"20","963":"22090603","964":"23","965":"5","966":"2","967":"13","968":"7","969":"39","970":"59","971":"7","972":"96","973":"180","974":"9","975":"63","976":"22","977":"11","978":"7","979":"16","980":"17017","981":"8","982":"3834","983":"21","984":"4","985":"1","986":"33","987":"11","988":"4","989":"1145","990":"9","991":"24","992":"41","993":"143550","994":"14","995":"16","996":"76","997":"54","998":"31"},"type":{"0":"division","1":"subtraction","2":"division","3":"subtraction","4":"multiplication","5":"subtraction","6":"addition","7":"subtraction","8":"division","9":"subtraction","10":"subtraction","11":"addition","12":"subtraction","13":"division","14":"addition","15":"division","16":"subtraction","17":"addition","18":"division","19":"subtraction","20":"subtraction","21":"multiplication","22":"multiplication","23":"addition","24":"addition","25":"multiplication","26":"subtraction","27":"division","28":"addition","29":"subtraction","30":"addition","31":"division","32":"subtraction","33":"division","34":"division","35":"subtraction","36":"subtraction","37":"subtraction","38":"subtraction","39":"division","40":"addition","41":"addition","42":"subtraction","43":"addition","44":"subtraction","45":"addition","46":"subtraction","47":"subtraction","48":"subtraction","49":"addition","50":"division","51":"addition","52":"subtraction","53":"subtraction","54":"addition","55":"subtraction","56":"subtraction","57":"addition","58":"subtraction","59":"subtraction","60":"subtraction","61":"subtraction","62":"division","63":"subtraction","64":"multiplication","65":"subtraction","66":"addition","67":"division","68":"subtraction","69":"addition","70":"division","71":"subtraction","72":"division","73":"subtraction","74":"subtraction","75":"addition","76":"addition","77":"subtraction","78":"division","79":"addition","80":"multiplication","81":"division","82":"subtraction","83":"multiplication","84":"subtraction","85":"subtraction","86":"subtraction","87":"subtraction","88":"division","89":"subtraction","90":"division","91":"division","92":"addition","93":"multiplication","94":"division","95":"subtraction","96":"addition","97":"division","98":"addition","99":"multiplication","100":"addition","101":"subtraction","102":"subtraction","103":"subtraction","104":"addition","105":"multiplication","106":"subtraction","107":"division","108":"addition","109":"addition","110":"division","111":"subtraction","112":"subtraction","113":"subtraction","114":"subtraction","115":"subtraction","116":"subtraction","117":"subtraction","118":"subtraction","119":"subtraction","120":"division","121":"division","122":"addition","123":"addition","124":"subtraction","125":"subtraction","126":"subtraction","127":"subtraction","128":"addition","129":"subtraction","130":"division","131":"addition","132":"subtraction","133":"addition","134":"division","135":"subtraction","136":"subtraction","137":"subtraction","138":"subtraction","139":"subtraction","140":"subtraction","141":"subtraction","142":"subtraction","143":"subtraction","144":"subtraction","145":"subtraction","146":"subtraction","147":"addition","148":"division","149":"multiplication","150":"division","151":"subtraction","152":"subtraction","153":"multiplication","154":"division","155":"addition","156":"subtraction","157":"division","158":"addition","159":"addition","160":"addition","161":"addition","162":"subtraction","163":"subtraction","164":"multiplication","165":"subtraction","166":"subtraction","167":"subtraction","168":"subtraction","169":"subtraction","170":"subtraction","171":"subtraction","172":"division","173":"multiplication","174":"division","175":"multiplication","176":"subtraction","177":"subtraction","178":"addition","179":"addition","180":"multiplication","181":"subtraction","182":"division","183":"subtraction","184":"subtraction","185":"subtraction","186":"division","187":"subtraction","188":"division","189":"multiplication","190":"subtraction","191":"addition","192":"subtraction","193":"division","194":"division","195":"addition","196":"multiplication","197":"subtraction","198":"subtraction","199":"subtraction","200":"subtraction","201":"addition","202":"addition","203":"division","204":"subtraction","205":"multiplication","206":"addition","207":"subtraction","208":"addition","209":"division","210":"subtraction","211":"subtraction","212":"addition","213":"division","214":"division","215":"subtraction","216":"addition","217":"addition","218":"subtraction","219":"division","220":"subtraction","221":"multiplication","222":"subtraction","223":"multiplication","224":"subtraction","225":"subtraction","226":"subtraction","227":"subtraction","228":"subtraction","229":"subtraction","230":"subtraction","231":"subtraction","232":"subtraction","233":"subtraction","234":"subtraction","235":"multiplication","236":"subtraction","237":"subtraction","238":"subtraction","239":"division","240":"subtraction","241":"division","242":"subtraction","243":"subtraction","244":"subtraction","245":"subtraction","246":"division","247":"addition","248":"addition","249":"multiplication","250":"subtraction","251":"multiplication","252":"division","253":"addition","254":"division","255":"addition","256":"multiplication","257":"subtraction","258":"subtraction","259":"subtraction","260":"subtraction","261":"subtraction","262":"division","263":"subtraction","264":"subtraction","265":"subtraction","266":"division","267":"addition","268":"addition","269":"division","270":"multiplication","271":"subtraction","272":"subtraction","273":"addition","274":"subtraction","275":"division","276":"multiplication","277":"subtraction","278":"multiplication","279":"multiplication","280":"subtraction","281":"subtraction","282":"subtraction","283":"subtraction","284":"multiplication","285":"subtraction","286":"subtraction","287":"division","288":"addition","289":"multiplication","290":"subtraction","291":"subtraction","292":"subtraction","293":"division","294":"addition","295":"subtraction","296":"subtraction","297":"addition","298":"division","299":"division","300":"division","301":"subtraction","302":"subtraction","303":"division","304":"division","305":"subtraction","306":"division","307":"subtraction","308":"subtraction","309":"addition","310":"subtraction","311":"subtraction","312":"subtraction","313":"multiplication","314":"subtraction","315":"subtraction","316":"addition","317":"addition","318":"subtraction","319":"subtraction","320":"addition","321":"addition","322":"division","323":"multiplication","324":"multiplication","325":"subtraction","326":"subtraction","327":"addition","328":"subtraction","329":"addition","330":"subtraction","331":"subtraction","332":"addition","333":"subtraction","334":"subtraction","335":"subtraction","336":"multiplication","337":"subtraction","338":"division","339":"addition","340":"subtraction","341":"subtraction","342":"addition","343":"division","344":"subtraction","345":"subtraction","346":"division","347":"subtraction","348":"addition","349":"addition","350":"addition","351":"subtraction","352":"subtraction","353":"subtraction","354":"division","355":"addition","356":"subtraction","357":"subtraction","358":"subtraction","359":"division","360":"multiplication","361":"subtraction","362":"multiplication","363":"multiplication","364":"multiplication","365":"addition","366":"multiplication","367":"addition","368":"addition","369":"addition","370":"subtraction","371":"multiplication","372":"subtraction","373":"subtraction","374":"addition","375":"division","376":"subtraction","377":"division","378":"subtraction","379":"multiplication","380":"subtraction","381":"subtraction","382":"division","383":"subtraction","384":"multiplication","385":"subtraction","386":"multiplication","387":"subtraction","388":"division","389":"subtraction","390":"subtraction","391":"division","392":"subtraction","393":"subtraction","394":"addition","395":"addition","396":"addition","397":"division","398":"addition","399":"subtraction","400":"subtraction","401":"subtraction","402":"subtraction","403":"addition","404":"subtraction","405":"multiplication","406":"subtraction","407":"subtraction","408":"subtraction","409":"division","410":"addition","411":"subtraction","412":"subtraction","413":"subtraction","414":"subtraction","415":"subtraction","416":"subtraction","417":"subtraction","418":"addition","419":"subtraction","420":"subtraction","421":"addition","422":"multiplication","423":"subtraction","424":"subtraction","425":"addition","426":"subtraction","427":"division","428":"subtraction","429":"subtraction","430":"subtraction","431":"subtraction","432":"addition","433":"subtraction","434":"division","435":"subtraction","436":"subtraction","437":"subtraction","438":"subtraction","439":"subtraction","440":"division","441":"subtraction","442":"multiplication","443":"addition","444":"multiplication","445":"subtraction","446":"multiplication","447":"subtraction","448":"subtraction","449":"division","450":"multiplication","451":"subtraction","452":"subtraction","453":"subtraction","454":"division","455":"subtraction","456":"division","457":"subtraction","458":"subtraction","459":"subtraction","460":"subtraction","461":"subtraction","462":"addition","463":"division","464":"subtraction","465":"subtraction","466":"subtraction","467":"addition","468":"subtraction","469":"addition","470":"subtraction","471":"subtraction","472":"subtraction","473":"subtraction","474":"addition","475":"subtraction","476":"division","477":"multiplication","478":"multiplication","479":"multiplication","480":"subtraction","481":"subtraction","482":"subtraction","483":"subtraction","484":"addition","485":"subtraction","486":"subtraction","487":"subtraction","488":"division","489":"multiplication","490":"subtraction","491":"subtraction","492":"subtraction","493":"subtraction","494":"subtraction","495":"addition","496":"subtraction","497":"multiplication","498":"subtraction","499":"addition","500":"subtraction","501":"subtraction","502":"addition","503":"subtraction","504":"subtraction","505":"subtraction","506":"addition","507":"subtraction","508":"subtraction","509":"subtraction","510":"division","511":"division","512":"subtraction","513":"addition","514":"addition","515":"subtraction","516":"subtraction","517":"division","518":"addition","519":"division","520":"subtraction","521":"multiplication","522":"subtraction","523":"addition","524":"multiplication","525":"subtraction","526":"subtraction","527":"subtraction","528":"addition","529":"addition","530":"subtraction","531":"subtraction","532":"division","533":"addition","534":"subtraction","535":"subtraction","536":"addition","537":"subtraction","538":"multiplication","539":"subtraction","540":"multiplication","541":"subtraction","542":"subtraction","543":"division","544":"subtraction","545":"division","546":"subtraction","547":"multiplication","548":"subtraction","549":"subtraction","550":"division","551":"subtraction","552":"multiplication","553":"division","554":"subtraction","555":"subtraction","556":"subtraction","557":"subtraction","558":"subtraction","559":"subtraction","560":"subtraction","561":"subtraction","562":"addition","563":"subtraction","564":"addition","565":"division","566":"subtraction","567":"subtraction","568":"subtraction","569":"subtraction","570":"subtraction","571":"addition","572":"addition","573":"subtraction","574":"division","575":"division","576":"subtraction","577":"division","578":"subtraction","579":"division","580":"subtraction","581":"subtraction","582":"division","583":"division","584":"addition","585":"subtraction","586":"division","587":"subtraction","588":"subtraction","589":"subtraction","590":"subtraction","591":"multiplication","592":"subtraction","593":"multiplication","594":"addition","595":"division","596":"subtraction","597":"subtraction","598":"subtraction","599":"addition","600":"subtraction","601":"subtraction","602":"subtraction","603":"subtraction","604":"division","605":"division","606":"subtraction","607":"multiplication","608":"addition","609":"multiplication","610":"subtraction","611":"addition","612":"addition","613":"subtraction","614":"addition","615":"subtraction","616":"subtraction","617":"subtraction","618":"division","619":"addition","620":"division","621":"subtraction","622":"subtraction","623":"multiplication","624":"subtraction","625":"division","626":"subtraction","627":"addition","628":"division","629":"subtraction","630":"addition","631":"multiplication","632":"addition","633":"subtraction","634":"subtraction","635":"subtraction","636":"multiplication","637":"subtraction","638":"addition","639":"multiplication","640":"addition","641":"subtraction","642":"subtraction","643":"multiplication","644":"division","645":"subtraction","646":"addition","647":"addition","648":"division","649":"subtraction","650":"subtraction","651":"division","652":"subtraction","653":"subtraction","654":"subtraction","655":"subtraction","656":"subtraction","657":"subtraction","658":"multiplication","659":"division","660":"subtraction","661":"division","662":"multiplication","663":"subtraction","664":"subtraction","665":"addition","666":"division","667":"subtraction","668":"subtraction","669":"subtraction","670":"subtraction","671":"subtraction","672":"subtraction","673":"subtraction","674":"multiplication","675":"subtraction","676":"division","677":"division","678":"addition","679":"division","680":"subtraction","681":"addition","682":"subtraction","683":"addition","684":"subtraction","685":"addition","686":"division","687":"addition","688":"addition","689":"addition","690":"addition","691":"subtraction","692":"multiplication","693":"division","694":"division","695":"subtraction","696":"subtraction","697":"addition","698":"division","699":"division","700":"subtraction","701":"subtraction","702":"subtraction","703":"multiplication","704":"subtraction","705":"subtraction","706":"subtraction","707":"multiplication","708":"multiplication","709":"addition","710":"subtraction","711":"subtraction","712":"subtraction","713":"subtraction","714":"addition","715":"subtraction","716":"division","717":"multiplication","718":"division","719":"division","720":"subtraction","721":"subtraction","722":"division","723":"subtraction","724":"subtraction","725":"subtraction","726":"division","727":"addition","728":"addition","729":"subtraction","730":"subtraction","731":"subtraction","732":"subtraction","733":"addition","734":"subtraction","735":"division","736":"subtraction","737":"division","738":"addition","739":"subtraction","740":"subtraction","741":"subtraction","742":"division","743":"subtraction","744":"subtraction","745":"multiplication","746":"addition","747":"addition","748":"division","749":"subtraction","750":"subtraction","751":"subtraction","752":"subtraction","753":"subtraction","754":"division","755":"division","756":"addition","757":"subtraction","758":"subtraction","759":"subtraction","760":"subtraction","761":"addition","762":"division","763":"division","764":"subtraction","765":"multiplication","766":"multiplication","767":"addition","768":"subtraction","769":"division","770":"subtraction","771":"subtraction","772":"subtraction","773":"subtraction","774":"subtraction","775":"addition","776":"addition","777":"addition","778":"subtraction","779":"division","780":"division","781":"division","782":"subtraction","783":"addition","784":"division","785":"addition","786":"subtraction","787":"subtraction","788":"subtraction","789":"division","790":"subtraction","791":"subtraction","792":"division","793":"addition","794":"division","795":"division","796":"subtraction","797":"addition","798":"division","799":"multiplication","800":"division","801":"multiplication","802":"subtraction","803":"subtraction","804":"subtraction","805":"addition","806":"subtraction","807":"subtraction","808":"addition","809":"subtraction","810":"subtraction","811":"subtraction","812":"subtraction","813":"division","814":"addition","815":"subtraction","816":"subtraction","817":"addition","818":"division","819":"subtraction","820":"subtraction","821":"subtraction","822":"subtraction","823":"subtraction","824":"subtraction","825":"multiplication","826":"subtraction","827":"subtraction","828":"subtraction","829":"division","830":"subtraction","831":"subtraction","832":"addition","833":"subtraction","834":"addition","835":"subtraction","836":"subtraction","837":"addition","838":"multiplication","839":"subtraction","840":"subtraction","841":"addition","842":"subtraction","843":"subtraction","844":"multiplication","845":"division","846":"subtraction","847":"multiplication","848":"division","849":"subtraction","850":"division","851":"subtraction","852":"division","853":"multiplication","854":"multiplication","855":"subtraction","856":"subtraction","857":"division","858":"subtraction","859":"subtraction","860":"addition","861":"multiplication","862":"subtraction","863":"addition","864":"addition","865":"multiplication","866":"division","867":"subtraction","868":"multiplication","869":"subtraction","870":"addition","871":"multiplication","872":"subtraction","873":"multiplication","874":"subtraction","875":"division","876":"subtraction","877":"division","878":"addition","879":"subtraction","880":"addition","881":"addition","882":"subtraction","883":"division","884":"subtraction","885":"subtraction","886":"multiplication","887":"division","888":"multiplication","889":"subtraction","890":"subtraction","891":"multiplication","892":"subtraction","893":"subtraction","894":"subtraction","895":"subtraction","896":"subtraction","897":"subtraction","898":"subtraction","899":"addition","900":"subtraction","901":"addition","902":"subtraction","903":"addition","904":"addition","905":"subtraction","906":"division","907":"subtraction","908":"multiplication","909":"subtraction","910":"addition","911":"addition","912":"addition","913":"subtraction","914":"subtraction","915":"subtraction","916":"addition","917":"subtraction","918":"subtraction","919":"subtraction","920":"addition","921":"subtraction","922":"subtraction","923":"subtraction","924":"subtraction","925":"subtraction","926":"addition","927":"subtraction","928":"addition","929":"addition","930":"subtraction","931":"subtraction","932":"subtraction","933":"subtraction","934":"subtraction","935":"subtraction","936":"subtraction","937":"addition","938":"addition","939":"multiplication","940":"addition","941":"division","942":"addition","943":"subtraction","944":"subtraction","945":"subtraction","946":"multiplication","947":"subtraction","948":"multiplication","949":"addition","950":"addition","951":"subtraction","952":"subtraction","953":"subtraction","954":"subtraction","955":"subtraction","956":"division","957":"division","958":"subtraction","959":"subtraction","960":"multiplication","961":"subtraction","962":"addition","963":"multiplication","964":"addition","965":"division","966":"division","967":"addition","968":"subtraction","969":"subtraction","970":"subtraction","971":"subtraction","972":"multiplication","973":"multiplication","974":"addition","975":"subtraction","976":"addition","977":"subtraction","978":"subtraction","979":"subtraction","980":"multiplication","981":"subtraction","982":"subtraction","983":"addition","984":"subtraction","985":"subtraction","986":"subtraction","987":"subtraction","988":"subtraction","989":"addition","990":"subtraction","991":"multiplication","992":"addition","993":"multiplication","994":"subtraction","995":"subtraction","996":"subtraction","997":"subtraction","998":"subtraction"}}